
 make.py started: 2018-01-28 19:43:25 C:\Users\giamb\Documents\GitHub\teen_obesity\analysis\Trends_in_obesity_nhanes\code 




Execute:  StataSE-64 /e do "./analysis.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.0   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     Special Edition                  College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

110-user Stata network perpetual license:
       Serial number:  401506201178
         Licensed to:  Brown University
                       Brown University

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  Maximum number of variables is set to 5000; see help set_maxvar.

. do ./analysis.do 

. set more off

. adopath + ../../../lib/stata/gslab_misc/ado
  [1]  (BASE)      "C:\Program Files (x86)\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files (x86)\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"

. adopath + ../../../lib/third_party/stata_tools
  [1]  (BASE)      "C:\Program Files (x86)\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files (x86)\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"
  [8]              "../../../lib/third_party/stata_tools"

. preliminaries, loadglob("../../../lib/python/obesity/input_params.txt")

. 
. program main
  1.     local base_dir = "${GoogleDrive}/base/nhanes"
  2.     
.     local group_list = `""2 18" "19 45""'
  3.     local idx: word count `group_list'
  4. 
.     forval col_index = 1/`idx' {
  5.         local group: word `col_index' of `group_list'
  6.         local init_year: word 1 of `group'
  7.         local last_year: word 2 of `group'
  8.         
.         use "`base_dir'/nhanes_1999-2016.dta", clear
  9.         build_continuous_nhanes, init_year(`init_year') ///
>             last_year(`last_year')
 10.             
.         use "`base_dir'/nhanesiii.dta", clear
 11.         build_nhanes_iii, init_year(`init_year') ///
>             last_year(`last_year')
 12.         
.         append using "../temp/continuous_nhanes_`init_year'to`last_year'.dta"
 13.         label var bmi_`init_year'to`last_year' "Average BMI `init_year' to `last_year' years of age"
 14.         label var survey_year "Survey year"
 15.     
.         save_data "../temp/merged_`init_year'to`last_year'.dta", ///
>             replace key(survey_year)
 16.     }
 17.     merge 1:1 survey_year using "../temp/merged_2to18.dta", ///
>         nogen assert(3) keep(3)
 18.     
.     local label_list = "1988-1991 1992-1994 1999-2000 2001-2002 2003-2004 " + ///
>                        "2005-2006 2007-2008 2009-2010 2011-2012 2013-2014 2015-2016"
 19.     local idx: word count `label_list'
 20. 
.     forval col_index = 1/`idx' {
 21.         local year_lab: word `col_index' of `label_list'
 22.         local define_label `define_label' `col_index' "`year_lab'"
 23.     }
 24.     
.     foreach group in 2to18 19to45 {
 25.         twoway (scatter bmi_`group' survey_year, msize(small) mcolor(gs9)   ///
>             xlabel(`define_label', labsize(small) angle(45)))               ///
>             (rcap bmi_`group'_ll bmi_`group'_ul survey_year), legend(off)
 26.         graph export "../output/bmi_`group'_nhanes.png", as(png) replace
 27.     }
 28. end

. 
. program build_continuous_nhanes
  1.     syntax, init_year(int) last_year(int)
  2.     
.     gen weight = 1/10*wtmec2yr
  3.     replace weight = 2/10*wtmec4yr if sddsrvyr == 1 | sddsrvyr == 2
  4.     svyset [w=weight], psu(sdmvpsu) strata(sdmvstra) vce(linearized)
  5. 
.     svy: mean bmxbmi, subpop(if ridageyr >= `init_year' & ///
>         ridageyr <= `last_year') over(sddsrvyr)
  6. 
.     extract_estimates, init_year(`init_year') ///
>         last_year(`last_year') pre_periods(2)
  7.     save_data "../temp/continuous_nhanes_`init_year'to`last_year'.dta", ///
>         replace key(survey_year)
  8. end

. 
. program build_nhanes_iii
  1.     syntax, init_year(int) last_year(int)
  2.     
.     rename *, lower
  3.     svyset [w=wtpfex6], psu(sdppsu6) strata(sdpstra6) vce(linearized)
  4.     
.     svy: mean bmpbmi, subpop(if hsageir >= `init_year' & ///
>         hsageir <= `last_year' & bmpbmi != 8888) over(sdpphase)
  5.         
.     extract_estimates, init_year(`init_year') ///
>         last_year(`last_year') pre_periods(0)
  6.     save_data "../temp/nhanes_iii_`init_year'to`last_year'.dta", ///
>         replace key(survey_year)
  7. end

. 
. program extract_estimates
  1.     syntax, init_year(int) last_year(int) pre_periods(int)
  2.     
.     matrix EST = r(table)
  3.     matrix EST = EST'
  4.     clear
  5.     svmat EST, names(col)
  6.     gen survey_year = _n + `pre_periods'
  7. 
.     rename b bmi_`init_year'to`last_year'
  8.     rename ll bmi_`init_year'to`last_year'_ll
  9.     rename ul bmi_`init_year'to`last_year'_ul
 10. end

. 
. * Execute
. main
(19,759 real changes made)
(sampling weights assumed)

      pweight: weight
          VCE: linearized
  Single unit: missing
     Strata 1: sdmvstra
         SU 1: sdmvpsu
        FPC 1: <zero>
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     133      Number of obs   =       87,420
Number of PSUs   =     271      Population size =  265,727,948
                                Subpop. no. obs =       31,871
                                Subpop. size    = 61,937,847.4
                                Design df       =          138

            1: sddsrvyr = 1
            2: sddsrvyr = 2
            3: sddsrvyr = 3
            4: sddsrvyr = 4
            5: sddsrvyr = 5
            6: sddsrvyr = 6
            7: sddsrvyr = 7
            8: sddsrvyr = 8
            9: sddsrvyr = 9

--------------------------------------------------------------
             |             Linearized
        Over |       Mean   Std. Err.     [95% Conf. Interval]
-------------+------------------------------------------------
bmxbmi       |
           1 |   19.58332   .1303433      19.32559    19.84105
           2 |   19.96125   .1470107      19.67056    20.25193
           3 |   20.17693   .1765271      19.82788    20.52597
           4 |   19.94098   .1635464       19.6176    20.26436
           5 |   20.07143    .215607      19.64511    20.49775
           6 |   20.11421   .1066827      19.90327    20.32516
           7 |   20.18654   .1525575      19.88489    20.48819
           8 |   20.31322    .150277      20.01608    20.61037
           9 |   20.38666   .2100547      19.97132      20.802
--------------------------------------------------------------
number of observations will be reset to 9
Press any key to continue, or Break to abort
number of observations (_N) was 0, now 9
(data now sorted by survey_year)
  variable survey_year was float now byte
  variable pvalue was float now byte
  variable df was float now int
  variable eform was float now byte
  (99 bytes saved)
==================================================================================================
File: ../temp/continuous_nhanes_2to18.dta
Key: survey_year
==================================================================================================
  9:10(45182):769582959:3785974565

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
 survey_year |          9           7    2.738613          3         11
   bmi_2to18 |          9    20.08162    .2373084   19.58332   20.38666
          se |          9    .1614007    .0351898   .1066827    .215607
           t |          9    129.8261    28.85647   93.09269   188.5424
      pvalue |          9           0           0          0          0
-------------+---------------------------------------------------------
bmi_2to18_ll |          9    19.76248    .2182594   19.32559   20.01608
bmi_2to18_ul |          9    20.40075    .2732703   19.84105     20.802
          df |          9         138           0        138        138
        crit |          9    1.977304           0   1.977304   1.977304
       eform |          9           0           0          0          0




(note: file ../temp/continuous_nhanes_2to18.dta not found)
file ../temp/continuous_nhanes_2to18.dta saved
(Written by R.              )
(sampling weights assumed)

      pweight: wtpfex6
          VCE: linearized
  Single unit: missing
     Strata 1: sdpstra6
         SU 1: sdppsu6
        FPC 1: <zero>
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =      49      Number of obs   =       29,350
Number of PSUs   =      98      Population size =  247,729,796
                                Subpop. no. obs =       10,505
                                Subpop. size    =   62,629,555
                                Design df       =           49

            1: sdpphase = 1
            2: sdpphase = 2

--------------------------------------------------------------
             |             Linearized
        Over |       Mean   Std. Err.     [95% Conf. Interval]
-------------+------------------------------------------------
bmpbmi       |
           1 |   18.81763   .1484071      18.51939    19.11586
           2 |   19.31443   .1628539      18.98716     19.6417
--------------------------------------------------------------
number of observations will be reset to 2
Press any key to continue, or Break to abort
number of observations (_N) was 0, now 2
(data now sorted by survey_year)
  variable survey_year was float now byte
  variable pvalue was float now byte
  variable df was float now byte
  variable eform was float now byte
  (24 bytes saved)
==================================================================================================
File: ../temp/nhanes_iii_2to18.dta
Key: survey_year
==================================================================================================
  2:10(45182):359848733:2857571855

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
 survey_year |          2         1.5    .7071068          1          2
   bmi_2to18 |          2    19.06603    .3512916   18.81763   19.31443
          se |          2    .1556305    .0102155   .1484071   .1628539
           t |          2    122.6985    5.796633   118.5997   126.7974
      pvalue |          2           0           0          0          0
-------------+---------------------------------------------------------
bmi_2to18_ll |          2    18.75328    .3307631   18.51939   18.98716
bmi_2to18_ul |          2    19.37878    .3718215   19.11586    19.6417
          df |          2          49           0         49         49
        crit |          2    2.009575           0   2.009575   2.009575
       eform |          2           0           0          0          0




(note: file ../temp/nhanes_iii_2to18.dta not found)
file ../temp/nhanes_iii_2to18.dta saved
(data now sorted by survey_year)
  variable survey_year was float now byte
  variable pvalue was float now byte
  variable df was float now int
  variable eform was float now byte
  (121 bytes saved)
==================================================================================================
File: ../temp/merged_2to18.dta
Key: survey_year
==================================================================================================
  11:10(45182):3750016447:4070975157

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
 survey_year |         11           6    3.316625          1         11
   bmi_2to18 |         11    19.89696    .4755734   18.81763   20.38666
          se |         11    .1603516     .031726   .1066827    .215607
           t |         11    128.5302    26.03516   93.09269   188.5424
      pvalue |         11           0           0          0          0
-------------+---------------------------------------------------------
bmi_2to18_ll |         11    19.57899    .4644471   18.51939   20.01608
bmi_2to18_ul |         11    20.21494    .4944422   19.11586     20.802
          df |         11    121.8182    36.00227         49        138
        crit |         11    1.983171    .0130545   1.977304   2.009575
       eform |         11           0           0          0          0




(note: file ../temp/merged_2to18.dta not found)
file ../temp/merged_2to18.dta saved
(19,759 real changes made)
(sampling weights assumed)

      pweight: weight
          VCE: linearized
  Single unit: missing
     Strata 1: sdmvstra
         SU 1: sdmvpsu
        FPC 1: <zero>
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     133      Number of obs   =       87,734
Number of PSUs   =     271      Population size =  265,524,723
                                Subpop. no. obs =       22,847
                                Subpop. size    =   98,204,127
                                Design df       =          138

            1: sddsrvyr = 1
            2: sddsrvyr = 2
            3: sddsrvyr = 3
            4: sddsrvyr = 4
            5: sddsrvyr = 5
            6: sddsrvyr = 6
            7: sddsrvyr = 7
            8: sddsrvyr = 8
            9: sddsrvyr = 9

--------------------------------------------------------------
             |             Linearized
        Over |       Mean   Std. Err.     [95% Conf. Interval]
-------------+------------------------------------------------
bmxbmi       |
           1 |   27.52063   .2351477      27.05567    27.98559
           2 |   27.43567   .1738785      27.09186    27.77948
           3 |   27.78596   .1819512      27.42618    28.14573
           4 |   28.03662   .3226843      27.39857    28.67466
           5 |   28.10061   .2562141      27.59399    28.60722
           6 |   28.17878   .1780537      27.82671    28.53085
           7 |   28.07288   .2449009      27.58864    28.55713
           8 |   28.76217   .2781117      28.21226    29.31208
           9 |   29.01116   .3028864      28.41226    29.61006
--------------------------------------------------------------
number of observations will be reset to 9
Press any key to continue, or Break to abort
number of observations (_N) was 0, now 9
(data now sorted by survey_year)
  variable survey_year was float now byte
  variable pvalue was float now byte
  variable df was float now int
  variable eform was float now byte
  (99 bytes saved)
==================================================================================================
File: ../temp/continuous_nhanes_19to45.dta
Key: survey_year
==================================================================================================
  9:10(105022):2477104455:342666125

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
 survey_year |          9           7    2.738613          3         11
  bmi_19to45 |          9     28.1005    .5190455   27.43567   29.01116
          se |          9    .2415365    .0549001   .1738785   .3226843
           t |          9    121.7985    27.46526   86.88559     158.26
      pvalue |          9           0           0          0          0
-------------+---------------------------------------------------------
bmi_19to4~ll |          9    27.62291    .4618927   27.05567   28.41226
bmi_19to4~ul |          9    28.57809    .5907957   27.77948   29.61006
          df |          9         138           0        138        138
        crit |          9    1.977304           0   1.977304   1.977304
       eform |          9           0           0          0          0




(note: file ../temp/continuous_nhanes_19to45.dta not found)
file ../temp/continuous_nhanes_19to45.dta saved
(Written by R.              )
(sampling weights assumed)

      pweight: wtpfex6
          VCE: linearized
  Single unit: missing
     Strata 1: sdpstra6
         SU 1: sdppsu6
        FPC 1: <zero>
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =      49      Number of obs   =       31,311
Number of PSUs   =      98      Population size =  251,097,002
                                Subpop. no. obs =        8,957
                                Subpop. size    =  107,723,383
                                Design df       =           49

            1: sdpphase = 1
            2: sdpphase = 2

--------------------------------------------------------------
             |             Linearized
        Over |       Mean   Std. Err.     [95% Conf. Interval]
-------------+------------------------------------------------
bmpbmi       |
           1 |   25.58092   .1692889      25.24072    25.92112
           2 |   26.18497   .1546751      25.87414     26.4958
--------------------------------------------------------------
number of observations will be reset to 2
Press any key to continue, or Break to abort
number of observations (_N) was 0, now 2
(data now sorted by survey_year)
  variable survey_year was float now byte
  variable pvalue was float now byte
  variable df was float now byte
  variable eform was float now byte
  (24 bytes saved)
==================================================================================================
File: ../temp/nhanes_iii_19to45.dta
Key: survey_year
==================================================================================================
  2:10(105022):2515814522:3236666519

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
 survey_year |          2         1.5    .7071068          1          2
  bmi_19to45 |          2    25.88295    .4271317   25.58092   26.18497
          se |          2     .161982    .0103336   .1546751   .1692889
           t |          2    160.1991    12.85672    151.108   169.2902
      pvalue |          2           0           0          0          0
-------------+---------------------------------------------------------
bmi_19to4~ll |          2    25.55743    .4478976   25.24072   25.87414
bmi_19to4~ul |          2    26.20846    .4063658   25.92112    26.4958
          df |          2          49           0         49         49
        crit |          2    2.009575           0   2.009575   2.009575
       eform |          2           0           0          0          0




(note: file ../temp/nhanes_iii_19to45.dta not found)
file ../temp/nhanes_iii_19to45.dta saved
(data now sorted by survey_year)
  variable survey_year was float now byte
  variable pvalue was float now byte
  variable df was float now int
  variable eform was float now byte
  (121 bytes saved)
==================================================================================================
File: ../temp/merged_19to45.dta
Key: survey_year
==================================================================================================
  11:10(105022):3268007152:973140900

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
 survey_year |         11           6    3.316625          1         11
  bmi_19to45 |         11    27.69731    1.019048   25.58092   29.01116
          se |         11     .227072    .0588008   .1546751   .3226843
           t |         11    128.7804    29.34794   86.88559   169.2902
      pvalue |         11           0           0          0          0
-------------+---------------------------------------------------------
bmi_19to4~ll |         11    27.24736    .9427835   25.24072   28.41226
bmi_19to4~ul |         11    28.14725    1.102082   25.92112   29.61006
          df |         11    121.8182    36.00227         49        138
        crit |         11    1.983171    .0130545   1.977304   2.009575
       eform |         11           0           0          0          0




(note: file ../temp/merged_19to45.dta not found)
file ../temp/merged_19to45.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                                11  
    -----------------------------------------
(note: file ../output/bmi_2to18_nhanes.png not found)
(file ../output/bmi_2to18_nhanes.png written in PNG format)
(note: file ../output/bmi_19to45_nhanes.png not found)
(file ../output/bmi_19to45_nhanes.png written in PNG format)

. 
end of do-file

 make.py ended: 2018-01-28 19:43:37
