
 make.py started: 2017-11-10 10:55:45 C:\Users\Samuele\Documents\GitHub\teen_obesity\derived\Load_bridging_the_gap_data\code 




Execute:  C:\Stata12_WinX86_x64\StataSE-64.exe /e do "./preclean_state.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   12.0   Copyright 1985-2011 StataCorp LP
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     Special Edition                  College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user Stata network perpetual license:
       Serial number:  93611859953
         Licensed to:  STATAforAll
                       STATA

Notes:
      1.  (/v# option or -set maxvar-) 5000 maximum variables
      2.  Stata running in batch mode

. do ./preclean_state.do 

. set more off

. adopath + ../../../lib/stata/gslab_misc/ado
  [1]  (UPDATES)   "C:\Stata12_WinX86_x64\ado\updates/"
  [2]  (BASE)      "C:\Stata12_WinX86_x64\ado\base/"
  [3]  (SITE)      "C:\Stata12_WinX86_x64\ado\site/"
  [4]              "."
  [5]  (PERSONAL)  "c:\ado\personal/"
  [6]  (PLUS)      "c:\ado\plus/"
  [7]  (OLDPLACE)  "c:\ado/"
  [8]              "../../../lib/stata/gslab_misc/ado"

. adopath + ../../../lib/third_party/stata_tools
  [1]  (UPDATES)   "C:\Stata12_WinX86_x64\ado\updates/"
  [2]  (BASE)      "C:\Stata12_WinX86_x64\ado\base/"
  [3]  (SITE)      "C:\Stata12_WinX86_x64\ado\site/"
  [4]              "."
  [5]  (PERSONAL)  "c:\ado\personal/"
  [6]  (PLUS)      "c:\ado\plus/"
  [7]  (OLDPLACE)  "c:\ado/"
  [8]              "../../../lib/stata/gslab_misc/ado"
  [9]              "../../../lib/third_party/stata_tools"

. preliminaries, loadglob("../../../lib/python/obesity/input
> _params.txt")

. 
. local raw_data_dir = "${GoogleDrive}/raw_data/bridging_the_gap/state/data"

. local derived_dir  = "${GoogleDrive}/derived/bridging_the_gap/state"

. 
. /*
>                      Stata Setup (Do File) for ICPSR 36527
>   
>          Bridging the Gap/National Wellness Policy Study State Wellness
>         Policy-Related Dataset, School Years 2006-2007 through 2013-2014
> 
> */
. 
. infile using "`raw_data_dir'/36527-0001-Setup.dct", using("`raw_data_dir'/36527-0001-Data.txt") clear

infile dictionary {

**********************************************************************
*                                                                         
*                   Stata Dictionary for ICPSR 36527
*
*    Bridging the Gap/National Wellness Policy Study State Wellness
*   Policy-Related Dataset, School Years 2006-2007 through 2013-2014
*
**********************************************************************

_lines(1)

_line(1)

_column(1)     str2  fipst              %2s    "fipst FIPS Code string"
_column(3)     str20 stname             %20s   "State Name"
_column(23)    int   fipstnum :fipstnum %2f    "fipstnum FIPS Code numeric"
_column(25)    str2  stabbrev           %2s    "State Abbreviation"
_column(27)    str2  gradelevel           %2s    "Gradelevel (string)"
_column(29)    int   gradelevelnumeric :gradelevelnumeric %1f    "Gradelevel (numeric)"
_column(30)    int   es       :es       %1f    "Policy applicable to Elementary School grades"
_column(31)    int   ms       :ms       %1f    "Policy applicable to Middle School grades"
_column(32)    int   hs       :hs       %1f    "Policy applicable to High School grades"
_column(33)    int   year     :year     %1f    "Data file year"
_column(34)    int   ne1s     :ne1s     %2f    "ne1s State: FW: Goals for NE"
_column(36)    int   ne2s     :ne2s     %2f    "ne2s State: Nutrition curriculum for each grade"
_column(38)    int   ne3s     :ne3s     %2f    "ne3s State: School gardens"
_column(40)    int   ne4s     :ne4s     %2f    "ne4s State: NE training for teachers"
_column(42)    int   ne5s     :ne5s     %2f    "ne5s State: NE integrated into other subjects"
_column(44)    int   ne6s     :ne6s     %2f    "ne6s State: NE teaches behavior-focused skills"
_column(46)    int   ne7s     :ne7s     %2f    "ne7s State: Number NE courses or hours specified"
_column(48)    int   us1s     :us1s     %2f    "us1s State: FW: School meal guidelines not less restrictive than federal guideli"
_column(50)    int   us2s     :us2s     %2f    "us2s State: School breakfast program"
_column(52)    int   us3s     :us3s     %2f    "us3s State: Guidelines beyond dietary guidelines"
_column(54)    int   us4s     :us4s     %2f    "us4s State: Low-fat cooking-methods"
_column(56)    int   us5s     :us5s     %2f    "us5s State: Strategies to increase participation"
_column(58)    int   us5as    :us5as    %2f    "us5as State: Closed campus provisions"
_column(60)    int   us6s     :us6s     %2f    "us6s State: Recess before lunch"
_column(62)    int   us7s     :us7s     %2f    "us7s State: Adequate time to eat"
_column(64)    int   us8s     :us8s     %2f    "us8s State: Training for food service staff"
_column(66)    int   us9s     :us9s     %2f    "us9s State: Nutrition information for school meals"
_column(68)    int   us10s    :us10s    %2f    "us10s State: Farm-to-school-cafeteria provisions"
_column(70)    int   us11s    :us11s    %2f    "us11s State: Fat content of milk-meals"
_column(72)    int   us12s    :us12s    %2f    "us12s State: Half of grains are whole grains-meals"
_column(74)    int   us13s    :us13s    %2f    "us13s State: Specifies number of fruits & veg-meals"
_column(76)    int   us14s    :us14s    %2f    "us14s State: Free drinking water during meals"
_column(78)    int   us15s    :us15s    %2f    "us15s State: Flavor of milk"
_column(80)    int   ng1s     :ng1s     %2f    "ng1s State: FW: NG for all foods at school (competitive foods)"
_column(82)    int   ng2s     :ng2s     %2f    "ng2s State: Competitive food ban-cannot be sold"
_column(84)    int   ng2sds   :ng2sds   %1f    "ng2sds State: Competitive food ban-school day"
_column(85)    int   ng3s     :ng3s     %2f    "ng3s State: Contract compliance with NG"
_column(87)    int   ng3sds   :ng3sds   %1f    "ng3sds State: Contract compliance-school day"
_column(88)    int   ng4s     :ng4s     %2f    "ng4s State: Fast food restrictions"
_column(90)    int   ng4sds   :ng4sds   %2f    "ng4sds State: Fast food restrictions-school day"
_column(92)    int   ng5s     :ng5s     %2f    "ng5s State: Meets IOM F&V and-or whole grain std"
_column(94)    int   ng5sds   :ng5sds   %2f    "ng5sds State: Meets IOM F&V and-or whole grain std-school day"
_column(96)    int   ng6s     :ng6s     %2f    "ng6s State: Whole, unprocessed & fresh food availability"
_column(98)    int   ng7s     :ng7s     %2f    "ng7s State: Food as reward or punishment"
_column(100)   int   ng8s     :ng8s     %2f    "ng8s State: Nutrition info for competitive foods"
_column(102)   int   ng9s     :ng9s     %2f    "ng9s State: Free drinking water"
_column(104)   int   ng10s    :ng10s    %2f    "ng10s State: Vending machines"
_column(106)   int   ng10sds  :ng10sds  %1f    "ng10sds State: Vending machines-school day"
_column(107)   int   ng16vms  :ng16vms  %2f    "ng16vms State: Vending: Sugar content of foods"
_column(109)   int   ng16vmsds :ng16vmsds %2f    "ng16vmsds State: Vending: Sugar content of foods-school day"
_column(111)   int   ng17vms  :ng17vms  %2f    "ng17vms State: Vending: Candy limits"
_column(113)   int   ng17vmsds :ng17vmsds %2f    "ng17vmsds State: Vending: Candy limits-school day"
_column(115)   int   ng18vms  :ng18vms  %2f    "ng18vms State: Vending: Fat content of foods"
_column(117)   int   ng18vmsds :ng18vmsds %2f    "ng18vmsds State: Vending: Fat content of foods-school day"
_column(119)   int   ng19vms  :ng19vms  %2f    "ng19vms State: Vending: Trans fat limits"
_column(121)   int   ng19vmsds :ng19vmsds %2f    "ng19vmsds State: Vending: Trans fat limits-school day"
_column(123)   int   ng20vms  :ng20vms  %2f    "ng20vms State: Vending: Sodium content of foods"
_column(125)   int   ng20vmsds :ng20vmsds %2f    "ng20vmsds State: Vending: Sodium content of foods-school day"
_column(127)   int   ng21vms  :ng21vms  %2f    "ng21vms State: Vending: Calorie content-serving size"
_column(129)   int   ng21vmsds :ng21vmsds %2f    "ng21vmsds State: Vending: Calorie content-serving size-school day"
_column(131)   int   ng22vms  :ng22vms  %2f    "ng22vms State: Vending: Sugar content of beverages"
_column(133)   int   ng22vmsds :ng22vmsds %2f    "ng22vmsds State: Vending: Sugar content of beverages-school day"
_column(135)   int   ng23vms  :ng23vms  %2f    "ng23vms State: Vending: Calorie content of beverages"
_column(137)   int   ng23vmsds :ng23vmsds %2f    "ng23vmsds State: Vending: Calorie content of beverages-school day"
_column(139)   int   ng24vms  :ng24vms  %2f    "ng24vms State: Vending: Regular, sugar-sweetened soda"
_column(141)   int   ng24vmsds :ng24vmsds %2f    "ng24vmsds State: Vending: Regular, sugar-sweetened soda-school day"
_column(143)   int   ng25vms  :ng25vms  %2f    "ng25vms State: Vending: Beverages other than regular soda"
_column(145)   int   ng25vmsds :ng25vmsds %2f    "ng25vmsds State: Vending: Beverages other than regular soda-school day"
_column(147)   int   ng26vms  :ng26vms  %2f    "ng26vms State: Vending: Sugar-calorie content of milk"
_column(149)   int   ng26vmsds :ng26vmsds %2f    "ng26vmsds State: Vending: Sugar-calorie content of milk-school day"
_column(151)   int   ng27vms  :ng27vms  %2f    "ng27vms State: Vending: Fat content of milk"
_column(153)   int   ng27vmsds :ng27vmsds %2f    "ng27vmsds State: Vending: Fat content of milk-school day"
_column(155)   int   ng28vms  :ng28vms  %2f    "ng28vms State: Vending: Serving size limit for beverages"
_column(157)   int   ng28vmsds :ng28vmsds %2f    "ng28vmsds State: Vending: Serving size limit for beverages-school day"
_column(159)   int   ng29vms  :ng29vms  %2f    "ng29vms State: Vending: Caffeine content of beverages"
_column(161)   int   ng30vms  :ng30vms  %2f    "ng30vms State Vending: Water available through Vending machines"
_column(163)   int   ng30vmsds :ng30vmsds %2f    "ng30vmsds State Vending: Water available through Vending machines-school day"
_column(165)   int   ng29vmsds :ng29vmsds %2f    "ng29vmsds State: Vending: Caffeine content of beverages-school day"
_column(167)   int   ng11s    :ng11s    %2f    "ng11s State: School stores"
_column(169)   int   ng11sds  :ng11sds  %1f    "ng11sds State: School Stores-school day"
_column(170)   int   ng16sss  :ng16sss  %2f    "ng16sss State: Stores: Sugar content of foods"
_column(172)   int   ng16sssds :ng16sssds %2f    "ng16sssds State: Stores: Sugar content of foods-school day"
_column(174)   int   ng17sss  :ng17sss  %2f    "ng17sss State: Stores: Candy limits"
_column(176)   int   ng17sssds :ng17sssds %2f    "ng17sssds State: Stores: Candy limits-school day"
_column(178)   int   ng18sss  :ng18sss  %2f    "ng18sss State: Stores: Fat content of foods"
_column(180)   int   ng18sssds :ng18sssds %2f    "ng18sssds State: Stores: Fat content of foods-school day"
_column(182)   int   ng19sss  :ng19sss  %2f    "ng19sss State: Stores: Trans fat limits"
_column(184)   int   ng19sssds :ng19sssds %2f    "ng19sssds State: Stores: Trans fat limits-school day"
_column(186)   int   ng20sss  :ng20sss  %2f    "ng20sss State: Stores: Sodium content of foods"
_column(188)   int   ng20sssds :ng20sssds %2f    "ng20sssds State: Stores: Sodium content of foods-school day"
_column(190)   int   ng21sss  :ng21sss  %2f    "ng21sss State: Stores: Calorie content-serving size"
_column(192)   int   ng21sssds :ng21sssds %2f    "ng21sssds State: Stores: Calorie content-serving size-school day"
_column(194)   int   ng22sss  :ng22sss  %2f    "ng22sss State: Stores: Sugar content of beverages"
_column(196)   int   ng22sssds :ng22sssds %2f    "ng22sssds State: Stores: Sugar content of beverages-school day"
_column(198)   int   ng23sss  :ng23sss  %2f    "ng23sss State: Stores: Calorie content of beverages"
_column(200)   int   ng23sssds :ng23sssds %2f    "ng23sssds State: Stores: Calorie content of beverages-school day"
_column(202)   int   ng24sss  :ng24sss  %2f    "ng24sss State: Stores: Regular, sugar-sweetened soda"
_column(204)   int   ng24sssds :ng24sssds %2f    "ng24sssds State: Stores: Regular, sugar-sweetened soda-school day"
_column(206)   int   ng25sss  :ng25sss  %2f    "ng25sss State: Stores: Beverages other than regular soda"
_column(208)   int   ng25sssds :ng25sssds %2f    "ng25sssds State: Stores: Beverages other than regular soda-school day"
_column(210)   int   ng26sss  :ng26sss  %2f    "ng26sss State: Stores: Sugar-calorie content of milk"
_column(212)   int   ng26sssds :ng26sssds %2f    "ng26sssds State: Stores: Sugar-calorie content of milk-school day"
_column(214)   int   ng27sss  :ng27sss  %2f    "ng27sss State: Stores: Fat content of milk"
_column(216)   int   ng27sssds :ng27sssds %2f    "ng27sssds State: Stores: Fat content of milk-school day"
_column(218)   int   ng28sss  :ng28sss  %2f    "ng28sss State: Stores: Serving size limit for beverages"
_column(220)   int   ng28sssds :ng28sssds %2f    "ng28sssds State: Stores: Serving size limit for beverages-school day"
_column(222)   int   ng29sss  :ng29sss  %2f    "ng29sss State: Stores: Caffeine content of beverages"
_column(224)   int   ng29sssds :ng29sssds %2f    "ng29sssds State: Stores: Caffeine content of beverages-school day"
_column(226)   int   ng30sss  :ng30sss  %2f    "ng30sss State Stores: Water available through school stores"
_column(228)   int   ng30ssds :ng30ssds %2f    "ng30ssds State Stores: Water available through school stores-school day"
_column(230)   int   ng12s    :ng12s    %2f    "ng12s State: A la carte"
_column(232)   int   ng16als  :ng16als  %2f    "ng16als State: A la carte: Sugar content of foods"
_column(234)   int   ng17als  :ng17als  %2f    "ng17als State: A la carte: Candy limits"
_column(236)   int   ng18als  :ng18als  %2f    "ng18als State: A la carte: Fat content of foods"
_column(238)   int   ng19als  :ng19als  %2f    "ng19als State: A la carte: Trans fat limits"
_column(240)   int   ng20als  :ng20als  %2f    "ng20als State: A la carte: Sodium content of foods"
_column(242)   int   ng21als  :ng21als  %2f    "ng21als State: A la carte: Calorie content-serving size"
_column(244)   int   ng22als  :ng22als  %2f    "ng22als State: A la carte: Sugar content of beverages"
_column(246)   int   ng23als  :ng23als  %2f    "ng23als State: A la carte: Calorie content of beverages"
_column(248)   int   ng24als  :ng24als  %2f    "ng24als State: A la carte: Regular, sugar-sweetened soda"
_column(250)   int   ng25als  :ng25als  %2f    "ng25als State: A la carte: Beverages other than regular soda"
_column(252)   int   ng26als  :ng26als  %2f    "ng26als State: A la carte: Sugar-calorie content of milk"
_column(254)   int   ng27als  :ng27als  %2f    "ng27als State: A la carte: Fat content of milk"
_column(256)   int   ng28als  :ng28als  %2f    "ng28als State: A la carte: Serving size limit for beverages"
_column(258)   int   ng29als  :ng29als  %2f    "ng29als State: A la carte: Caffeine content of beverages"
_column(260)   int   ng30als  :ng30als  %2f    "ng30als State A la carte: Water available through A la carte"
_column(262)   int   ng13s    :ng13s    %2f    "ng13s State: Parties"
_column(264)   int   ng16cps  :ng16cps  %2f    "ng16cps State Parties: Sugar content of foods"
_column(266)   int   ng17cps  :ng17cps  %2f    "ng17cps State Parties: Candy limits"
_column(268)   int   ng18cps  :ng18cps  %2f    "ng18cps State Parties: Fat content of foods"
_column(270)   int   ng19cps  :ng19cps  %2f    "ng19cps State Parties: Trans fat limits"
_column(272)   int   ng20cps  :ng20cps  %2f    "ng20cps State Parties: Sodium content of foods"
_column(274)   int   ng21cps  :ng21cps  %2f    "ng21cps State Parties: Calorie content-serving size"
_column(276)   int   ng22cps  :ng22cps  %2f    "ng22cps State Parties: Sugar content of beverages"
_column(278)   int   ng23cps  :ng23cps  %2f    "ng23cps State Parties: Calorie content of beverages"
_column(280)   int   ng24cps  :ng24cps  %2f    "ng24cps State Parties: Regular, sugar-sweetened soda"
_column(282)   int   ng25cps  :ng25cps  %2f    "ng25cps State Parties: Beverages other than regular soda"
_column(284)   int   ng26cps  :ng26cps  %2f    "ng26cps State Parties: Sugar-calorie content of milk"
_column(286)   int   ng27cps  :ng27cps  %2f    "ng27cps State Parties: Fat content of milk"
_column(288)   int   ng28cps  :ng28cps  %2f    "ng28cps State Parties: Serving size limit for beverages"
_column(290)   int   ng29cps  :ng29cps  %2f    "ng29cps State Parties: Caffeine content of beverages"
_column(292)   int   ng14s    :ng14s    %2f    "ng14s State: Events"
_column(294)   int   ng16evs  :ng16evs  %2f    "ng16evs State Events: Sugar content of foods"
_column(296)   int   ng17evs  :ng17evs  %2f    "ng17evs State Events: Candy limits"
_column(298)   int   ng18evs  :ng18evs  %2f    "ng18evs State Events: Fat content of foods"
_column(300)   int   ng19evs  :ng19evs  %2f    "ng19evs State Events: Trans fat limits"
_column(302)   int   ng20evs  :ng20evs  %2f    "ng20evs State Events: Sodium content of foods"
_column(304)   int   ng21evs  :ng21evs  %2f    "ng21evs State Events: Calorie content-serving size"
_column(306)   int   ng22evs  :ng22evs  %2f    "ng22evs State Events: Sugar content of beverages"
_column(308)   int   ng23evs  :ng23evs  %2f    "ng23evs State Events: Calorie content of beverages"
_column(310)   int   ng24evs  :ng24evs  %2f    "ng24evs State Events: Regular, sugar-sweetened soda"
_column(312)   int   ng25evs  :ng25evs  %2f    "ng25evs State Events: Beverages other than regular soda"
_column(314)   int   ng26evs  :ng26evs  %2f    "ng26evs State Events: Sugar-calorie content of milk"
_column(316)   int   ng27evs  :ng27evs  %2f    "ng27evs State Events: Fat content of milk"
_column(318)   int   ng28evs  :ng28evs  %2f    "ng28evs State Events: Serving size limit for beverages"
_column(320)   int   ng29evs  :ng29evs  %2f    "ng29evs State Events: Caffeine content of beverages"
_column(322)   int   ng15s    :ng15s    %2f    "ng15s State: Fundraisers"
_column(324)   int   ng15s_old :ng15s_old %2f    "ng15s State: Fundraisers (old coding)"
_column(326)   int   ng15sds  :ng15sds  %1f    "ng15sds State: Fundraisers-school day"
_column(327)   int   ng16frs  :ng16frs  %2f    "ng16frs State Fundraisers: Sugar content of foods"
_column(329)   int   ng16frsds :ng16frsds %2f    "ng16frsds State Fundraisers: Sugar content of foods-school day"
_column(331)   int   ng17frs  :ng17frs  %2f    "ng17frs State Fundraisers: Candy limits"
_column(333)   int   ng17frsds :ng17frsds %2f    "ng17frsds State Fundraisers: Candy limits-school day"
_column(335)   int   ng18frs  :ng18frs  %2f    "ng18frs State Fundraisers: Fat content of foods"
_column(337)   int   ng18frsds :ng18frsds %2f    "ng18frsds State Fundraisers: Fat content of foods-school day"
_column(339)   int   ng19frs  :ng19frs  %2f    "ng19frs State Fundraisers: Trans fat limits"
_column(341)   int   ng19frsds :ng19frsds %2f    "ng19frsds State Fundraisers: Trans fat limits-school day"
_column(343)   int   ng20frs  :ng20frs  %2f    "ng20frs State Fundraisers: Sodium content of foods"
_column(345)   int   ng20frsds :ng20frsds %2f    "ng20frsds State Fundraisers: Sodium content of foods-school day"
_column(347)   int   ng21frs  :ng21frs  %2f    "ng21frs State Fundraisers: Calorie content-serving size"
_column(349)   int   ng21frsds :ng21frsds %2f    "ng21frsds State Fundraisers: Calorie content-serving size-school day"
_column(351)   int   ng22frs  :ng22frs  %2f    "ng22frs State Fundraisers: Sugar content of beverages"
_column(353)   int   ng22frsds :ng22frsds %2f    "ng22frsds State Fundraisers: Sugar content of beverages-school day"
_column(355)   int   ng23frs  :ng23frs  %2f    "ng23frs State Fundraisers: Calorie content of beverages"
_column(357)   int   ng23frsds :ng23frsds %2f    "ng23frsds State Fundraisers: Calorie content of beverages-school day"
_column(359)   int   ng24frs  :ng24frs  %2f    "ng24frs State Fundraisers: Regular, sugar-sweetened soda"
_column(361)   int   ng24frsds :ng24frsds %2f    "ng24frsds State Fundraisers: Regular, sugar-sweetened soda-school day"
_column(363)   int   ng25frs  :ng25frs  %2f    "ng25frs State Fundraisers: Beverages other than regular soda"
_column(365)   int   ng25frsds :ng25frsds %2f    "ng25frsds State Fundraisers: Beverages other than regular soda-school day"
_column(367)   int   ng26frs  :ng26frs  %2f    "ng26frs State Fundraisers: Sugar-calorie content of milk"
_column(369)   int   ng26frsds :ng26frsds %2f    "ng26frsds State Fundraisers: Sugar-calorie content of milk-school day"
_column(371)   int   ng27frs  :ng27frs  %2f    "ng27frs State Fundraisers: Fat content of milk"
_column(373)   int   ng27frsds :ng27frsds %2f    "ng27frsds State Fundraisers: Fat content of milk-school day"
_column(375)   int   ng28frs  :ng28frs  %2f    "ng28frs State Fundraisers: Serving size limit for beverages"
_column(377)   int   ng28frsds :ng28frsds %2f    "ng28frsds State Fundraisers: Serving size limit for beverages-school day"
_column(379)   int   ng29frs  :ng29frs  %2f    "ng29frs State Fundraisers: Caffeine content of beverages"
_column(381)   int   ng29frsds :ng29frsds %2f    "ng29frsds State Fundraisers: Caffeine content of beverages-school day"
_column(383)   int   pe1s     :pe1s     %2f    "pe1s State: PE mentioned"
_column(385)   int   pe2s     :pe2s     %2f    "pe2s State: PE curriculum for each grade"
_column(387)   int   pe3s     :pe3s     %2f    "pe3s State: Time-week of PE for ES"
_column(389)   int   pe4s     :pe4s     %2f    "pe4s State: Time-week of PE for MS"
_column(391)   int   pe5s     :pe5s     %2f    "pe5s State: Time-week of PE for HS"
_column(393)   int   pe6s     :pe6s     %2f    "pe6s State: PE teaches physically active lifestyle"
_column(395)   int   pe7s     :pe7s     %2f    "pe7s State: PE competency assessment"
_column(397)   int   pe8s     :pe8s     %2f    "pe8s State: Addresses PE classes-credits-course-hours"
_column(399)   int   pe9s     :pe9s     %2f    "pe9s State: Frequency of required PE"
_column(401)   int   pe9as    :pe9as    %2f    "pe9as State only: Addresses daily PE waiver"
_column(403)   int   pe10s    :pe10s    %2f    "pe10s State: Teacher-student ratio for PE"
_column(405)   int   pe11s    :pe11s    %2f    "pe11s State: Safe-adequate equipment-facilities for PE"
_column(407)   int   pe12s    :pe12s    %2f    "pe12s State: Moderate to vigorous PA during PE class time"
_column(409)   int   pe13s    :pe13s    %2f    "pe13s State: Qualifications of PE instructors"
_column(411)   int   pe14s    :pe14s    %2f    "pe14s State: PE training for teachers"
_column(413)   int   pe15s    :pe15s    %2f    "pe15s State: PE waiver requirements"
_column(415)   int   pe16s    :pe16s    %2f    "pe16s State: Annual health assessment"
_column(417)   int   pe17s    :pe17s    %2f    "pe17s State: Free drinking water in the gymnasium"
_column(419)   int   pa1s     :pa1s     %2f    "pa1s State: FW: Goals for PA"
_column(421)   int   pa2s     :pa2s     %2f    "pa2s State: PA for every grade level"
_column(423)   int   pa3s     :pa3s     %2f    "pa3s State: Amount of time for PA"
_column(425)   int   pa3bs    :pa3bs    %2f    "pa3bs State: Definition of PA includes PE"
_column(427)   int   pa3cs    :pa3cs    %2f    "pa3cs State: Definition of PA includes recess"
_column(429)   int   pa4s     :pa4s     %2f    "pa4s State: PA throughout the day"
_column(431)   int   pa5s     :pa5s     %2f    "pa5s State: Community use facilities for PA"
_column(433)   int   pa6s     :pa6s     %2f    "pa6s State: Safe active routes to school"
_column(435)   int   pa7s     :pa7s     %2f    "pa7s State: Not using PA as punishment"
_column(437)   int   pa8s     :pa8s     %2f    "pa8s State: Recess freq or amount for ES (daily)"
_column(439)   int   pa9s     :pa9s     %2f    "pa9s State: Recess freq (less than daily) for ES"
_column(441)   int   pa10s    :pa10s    %2f    "pa10s State: PA before/after school (excluding intra/extramural"
_column(443)   int   pa11s    :pa11s    %2f    "pa11s State only: Community use facilities State law"
_column(445)   int   st1s     :st1s     %2f    "st1s State: PA for school staff"
_column(447)   int   st2s     :st2s     %2f    "st2s State: Staff wellness programs"
_column(449)   int   st3s     :st3s     %2f    "st3s State: Staff to role model"
_column(451)   int   cp1s     :cp1s     %2f    "cp1s State: FW: Stakeholders involved in development of wellness policy"
_column(453)   int   cp2s     :cp2s     %2f    "cp2s State: Methods to solicit input"
_column(455)   int   cp3s     :cp3s     %2f    "cp3s State: How to engage parents-community"
_column(457)   int   cp4s     :cp4s     %2f    "cp4s State: Stakeholders involved in periodic review of WP (Y6)"
_column(459)   int   cp5s     :cp5s     %2f    "cp5s State: Stakeholders involved in update of WP (Y6)"
_column(461)   int   mp1s     :mp1s     %2f    "mp1s State: Coordinated school health model"
_column(463)   int   mp2s     :mp2s     %2f    "mp2s State: Marketing-promotion of healthy choices"
_column(465)   int   mp3s     :mp3s     %2f    "mp3s State: Restricted marketing"
_column(467)   int   e1s      :e1s      %2f    "e1s State: FW: Measuring implementation"
_column(469)   int   e2s      :e2s      %2f    "e2s State: Plan for implementation"
_column(471)   int   e3s      :e3s      %2f    "e3s State: Ongoing health advisory committee"
_column(473)   int   e4s_new  :e4s_new  %2f    "e4s_new State: New BMI measurement"
_column(475)   int   e5s      :e5s      %2f    "e5s State: Plan for evaluation"
_column(477)   int   e6s      :e6s      %2f    "e6s State: Audience and frequency of reporting"
_column(479)   int   e7s      :e7s      %2f    "e7s State: Funding support"
_column(481)   int   e8s      :e8s      %2f    "e8s State: Plan for revising the policy"
_column(483)   int   e12s     :e12s     %2f    "e12s State: Requires District to report to State"
_column(485)   int   e13s     :e13s     %2f    "e13s State only: TA to District-LEA for wellness policy implementation"
_column(487)   int   e14s     :e14s     %2f    "e14s State only: Monitor schools-LEA for compliance with State requirements"
_column(489)   int   e15s     :e15s     %2f    "e15s State only: Penalties for District failure to comply"
_column(491)   int   e16s     :e16s     %2f    "e16s State only: Corrective action plan for schools-LEA for non-compliance"
_column(493)   int   e17s     :e17s     %2f    "e17s State only: State evaluation and reporting required"
_column(495)   int   r1s      :r1s      %2f    "r1s State: Public posting-access to WP on web"
_column(497)   int   r2s      :r2s      %2f    "r2s State: Public posting-access to WP on non-web"
_column(499)   int   r3s      :r3s      %2f    "r3s State: District reporting of WP to State"
_column(501)   int   r3ss     :r3ss     %2f    "r3ss State: State DOE-BOE posts District wp on its website"
_column(503)   int   r4s      :r4s      %2f    "r4s State: Reporting to public"
_column(505)   int   r5s      :r5s      %2f    "r5s State: Reporting to District"
_column(507)   int   r6s      :r6s      %2f    "r6s State: Reporting to State"
_column(509)   int   r7s      :r7s      %2f    "r7s State: Reporting to other-or non-specific reporting requirement"
_column(511)   int   r8s      :r8s      %2f    "r8s State: Reporting on food safety inspections"
_column(513)   int   r9s      :r9s      %2f    "r9s State: Reporting on local wp compliance"
_column(515)   int   r10s     :r10s     %2f    "r10s State: Reporting on meal program participation"
_column(517)   int   r11s     :r11s     %2f    "r11s State: Reporting nutritional quality of program meals"
_column(519)   int   r12s     :r12s     %2f    "r12s State: Reporting on competitive f&b available-sold"
_column(521)   int   r13s     :r13s     %2f    "r13s State: Reporting on PE-PA requirements"
_column(523)   int   r14s     :r14s     %2f    "r14s State: Reporting on fitness assessments"
_column(525)   int   r15s     :r15s     %2f    "r15s State: Reporting on BMI"
_column(527)   int   r16s     :r16s     %2f    "r16s State: Reporting on other-School Health Index"
_column(529)   int   northeast :northeast %1f    "Census Region: Northeast"
_column(530)   int   midwest  :midwest  %1f    "Census Region: Midwest"
_column(531)   int   south    :south    %1f    "Census Region: South"
_column(532)   int   west     :west     %1f    "Census Region: West"
_column(533)   int   region   :region   %1f    "Census Region"
_column(534)   int   newengland :newengland %1f    "Division 1: New England"
_column(535)   int   midatlantic :midatlantic %1f    "Division 2: Mid-Atlantic"
_column(536)   int   eastnorcen :eastnorcen %1f    "Division 3: East North Central"
_column(537)   int   wesnorcen :wesnorcen %1f    "Division 4: West North Central"
_column(538)   int   southatl :southatl %1f    "Division 5: South Atlantic"
_column(539)   int   eastsocen :eastsocen %1f    "Division 6: East South Central"
_column(540)   int   westsocen :westsocen %1f    "Division 7: West South Central"
_column(541)   int   mountain :mountain %1f    "Division 8: Mountain"
_column(542)   int   pacific  :pacific  %1f    "Division 9: Pacific"
_column(543)   int   division :division %1f    "Census Division"
}

(1224 observations read)

. 
. #delimit ;
delimiter now ;
. recode ne1s-r16s (-6 = .c) (-7 = .g) (-9 = .n);
(ne1s: 0 changes made)
(ne2s: 0 changes made)
(ne3s: 306 changes made)
(ne4s: 0 changes made)
(ne5s: 0 changes made)
(ne6s: 0 changes made)
(ne7s: 0 changes made)
(us1s: 0 changes made)
(us2s: 0 changes made)
(us3s: 0 changes made)
(us4s: 0 changes made)
(us5s: 0 changes made)
(us5as: 0 changes made)
(us6s: 918 changes made)
(us7s: 0 changes made)
(us8s: 0 changes made)
(us9s: 0 changes made)
(us10s: 0 changes made)
(us11s: 459 changes made)
(us12s: 459 changes made)
(us13s: 459 changes made)
(us14s: 765 changes made)
(us15s: 918 changes made)
(ng1s: 0 changes made)
(ng2s: 0 changes made)
(ng2sds: 0 changes made)
(ng3s: 0 changes made)
(ng3sds: 0 changes made)
(ng4s: 0 changes made)
(ng4sds: 306 changes made)
(ng5s: 306 changes made)
(ng5sds: 306 changes made)
(ng6s: 0 changes made)
(ng7s: 0 changes made)
(ng8s: 0 changes made)
(ng9s: 0 changes made)
(ng10s: 0 changes made)
(ng10sds: 0 changes made)
(ng16vms: 306 changes made)
(ng16vmsds: 306 changes made)
(ng17vms: 306 changes made)
(ng17vmsds: 306 changes made)
(ng18vms: 306 changes made)
(ng18vmsds: 306 changes made)
(ng19vms: 306 changes made)
(ng19vmsds: 306 changes made)
(ng20vms: 306 changes made)
(ng20vmsds: 306 changes made)
(ng21vms: 306 changes made)
(ng21vmsds: 306 changes made)
(ng22vms: 306 changes made)
(ng22vmsds: 306 changes made)
(ng23vms: 306 changes made)
(ng23vmsds: 306 changes made)
(ng24vms: 306 changes made)
(ng24vmsds: 306 changes made)
(ng25vms: 306 changes made)
(ng25vmsds: 306 changes made)
(ng26vms: 306 changes made)
(ng26vmsds: 306 changes made)
(ng27vms: 306 changes made)
(ng27vmsds: 306 changes made)
(ng28vms: 306 changes made)
(ng28vmsds: 306 changes made)
(ng29vms: 306 changes made)
(ng30vms: 765 changes made)
(ng30vmsds: 765 changes made)
(ng29vmsds: 306 changes made)
(ng11s: 0 changes made)
(ng11sds: 0 changes made)
(ng16sss: 306 changes made)
(ng16sssds: 306 changes made)
(ng17sss: 306 changes made)
(ng17sssds: 306 changes made)
(ng18sss: 306 changes made)
(ng18sssds: 306 changes made)
(ng19sss: 306 changes made)
(ng19sssds: 306 changes made)
(ng20sss: 306 changes made)
(ng20sssds: 306 changes made)
(ng21sss: 306 changes made)
(ng21sssds: 306 changes made)
(ng22sss: 306 changes made)
(ng22sssds: 306 changes made)
(ng23sss: 306 changes made)
(ng23sssds: 306 changes made)
(ng24sss: 306 changes made)
(ng24sssds: 306 changes made)
(ng25sss: 306 changes made)
(ng25sssds: 306 changes made)
(ng26sss: 306 changes made)
(ng26sssds: 306 changes made)
(ng27sss: 306 changes made)
(ng27sssds: 306 changes made)
(ng28sss: 306 changes made)
(ng28sssds: 306 changes made)
(ng29sss: 306 changes made)
(ng29sssds: 306 changes made)
(ng30sss: 765 changes made)
(ng30ssds: 765 changes made)
(ng12s: 0 changes made)
(ng16als: 306 changes made)
(ng17als: 306 changes made)
(ng18als: 306 changes made)
(ng19als: 306 changes made)
(ng20als: 306 changes made)
(ng21als: 306 changes made)
(ng22als: 306 changes made)
(ng23als: 306 changes made)
(ng24als: 306 changes made)
(ng25als: 306 changes made)
(ng26als: 306 changes made)
(ng27als: 306 changes made)
(ng28als: 306 changes made)
(ng29als: 306 changes made)
(ng30als: 765 changes made)
(ng13s: 0 changes made)
(ng16cps: 306 changes made)
(ng17cps: 306 changes made)
(ng18cps: 306 changes made)
(ng19cps: 306 changes made)
(ng20cps: 306 changes made)
(ng21cps: 306 changes made)
(ng22cps: 306 changes made)
(ng23cps: 306 changes made)
(ng24cps: 306 changes made)
(ng25cps: 306 changes made)
(ng26cps: 306 changes made)
(ng27cps: 306 changes made)
(ng28cps: 306 changes made)
(ng29cps: 306 changes made)
(ng14s: 459 changes made)
(ng16evs: 765 changes made)
(ng17evs: 765 changes made)
(ng18evs: 765 changes made)
(ng19evs: 765 changes made)
(ng20evs: 765 changes made)
(ng21evs: 765 changes made)
(ng22evs: 765 changes made)
(ng23evs: 765 changes made)
(ng24evs: 765 changes made)
(ng25evs: 765 changes made)
(ng26evs: 765 changes made)
(ng27evs: 765 changes made)
(ng28evs: 765 changes made)
(ng29evs: 765 changes made)
(ng15s: 306 changes made)
(ng15s_old: 918 changes made)
(ng15sds: 0 changes made)
(ng16frs: 306 changes made)
(ng16frsds: 306 changes made)
(ng17frs: 306 changes made)
(ng17frsds: 306 changes made)
(ng18frs: 306 changes made)
(ng18frsds: 306 changes made)
(ng19frs: 306 changes made)
(ng19frsds: 306 changes made)
(ng20frs: 306 changes made)
(ng20frsds: 306 changes made)
(ng21frs: 306 changes made)
(ng21frsds: 306 changes made)
(ng22frs: 306 changes made)
(ng22frsds: 306 changes made)
(ng23frs: 306 changes made)
(ng23frsds: 306 changes made)
(ng24frs: 306 changes made)
(ng24frsds: 306 changes made)
(ng25frs: 306 changes made)
(ng25frsds: 306 changes made)
(ng26frs: 306 changes made)
(ng26frsds: 306 changes made)
(ng27frs: 306 changes made)
(ng27frsds: 306 changes made)
(ng28frs: 306 changes made)
(ng28frsds: 306 changes made)
(ng29frs: 306 changes made)
(ng29frsds: 306 changes made)
(pe1s: 0 changes made)
(pe2s: 0 changes made)
(pe3s: 816 changes made)
(pe4s: 816 changes made)
(pe5s: 816 changes made)
(pe6s: 0 changes made)
(pe7s: 0 changes made)
(pe8s: 816 changes made)
(pe9s: 0 changes made)
(pe9as: 306 changes made)
(pe10s: 0 changes made)
(pe11s: 306 changes made)
(pe12s: 0 changes made)
(pe13s: 0 changes made)
(pe14s: 0 changes made)
(pe15s: 0 changes made)
(pe16s: 0 changes made)
(pe17s: 765 changes made)
(pa1s: 0 changes made)
(pa2s: 0 changes made)
(pa3s: 306 changes made)
(pa3bs: 1140 changes made)
(pa3cs: 1188 changes made)
(pa4s: 0 changes made)
(pa5s: 0 changes made)
(pa6s: 0 changes made)
(pa7s: 0 changes made)
(pa8s: 816 changes made)
(pa9s: 918 changes made)
(pa10s: 765 changes made)
(pa11s: 765 changes made)
(st1s: 0 changes made)
(st2s: 0 changes made)
(st3s: 0 changes made)
(cp1s: 0 changes made)
(cp2s: 0 changes made)
(cp3s: 0 changes made)
(cp4s: 765 changes made)
(cp5s: 765 changes made)
(mp1s: 0 changes made)
(mp2s: 0 changes made)
(mp3s: 0 changes made)
(e1s: 0 changes made)
(e2s: 0 changes made)
(e3s: 0 changes made)
(e4s_new: 0 changes made)
(e5s: 0 changes made)
(e6s: 0 changes made)
(e7s: 0 changes made)
(e8s: 0 changes made)
(e12s: 0 changes made)
(e13s: 0 changes made)
(e14s: 0 changes made)
(e15s: 0 changes made)
(e16s: 0 changes made)
(e17s: 0 changes made)
(r1s: 612 changes made)
(r2s: 612 changes made)
(r3s: 612 changes made)
(r3ss: 612 changes made)
(r4s: 612 changes made)
(r5s: 612 changes made)
(r6s: 612 changes made)
(r7s: 612 changes made)
(r8s: 612 changes made)
(r9s: 612 changes made)
(r10s: 612 changes made)
(r11s: 612 changes made)
(r12s: 612 changes made)
(r13s: 612 changes made)
(r14s: 612 changes made)
(r15s: 612 changes made)
(r16s: 612 changes made)

. label define fipstnum  1 "Alabama" 2 "Alaska" 4 "Arizona" 5 "Arkansas"
>                        6 "California" 8 "Colorado" 9 "Connecticut"
>                        10 "Delaware" 11 "District of Columbia" 12 "Florida"
>                        13 "Georgia" 14 "Guam" 15 "Hawaii" 16 "Idaho"
>                        17 "Illinois" 18 "Indiana" 19 "Iowa" 20 "Kansas"
>                        21 "Kentucky" 22 "Louisiana" 23 "Maine" 24 "Maryland"
>                        25 "Massachusetts" 26 "Michigan" 27 "Minnesota"
>                        28 "Mississippi" 29 "Missouri" 30 "Montana"
>                        31 "Nebraska" 32 "Nevada" 33 "New Hampshire"
>                        34 "New Jersey" 35 "New Mexico" 36 "New York"
>                        37 "North Carolina" 38 "North Dakota" 39 "Ohio"
>                        40 "Oklahoma" 41 "Oregon" 42 "Pennsylvania"
>                        43 "Puerto Rico" 44 "Rhode Island" 45 "South Carolina"
>                        46 "South Dakota" 47 "Tennessee" 48 "Texas" 49 "Utah"
>                        50 "Vermont" 51 "Virginia" 52 "Virgin Islands"
>                        53 "Washington" 54 "West Virginia" 55 "Wisconsin"
>                        56 "Wyoming" 58 "DOD Dependents Schools-Overseas"
>                        59 "Bureau of Indian Affairs" 60 "American Samoa"
>                        61 "DOD Dependents Schools-domestic"
>                        63 "Department of Defense Education Activity"
>                        66 "Guam" 69 "Mariana Islands" 70 "Palau"
>                        72 "Puerto Rico" 78 "Virgin Islands" ;

. label define gradelevelnumeric 1 "ES" 2 "MS" 3 "HS" ;

. label define es        0 "No" 1 "Yes" ;

. label define ms        0 "No" 1 "Yes" ;

. label define hs        0 "No" 1 "Yes" ;

. label define year      1 "Y1_0607" 2 "Y2_0708" 3 "Y3_0809" 4 "Y4_0910"
>                        5 "Y5_1011" 6 "Y6_1112" 7 "Y7_1213" 8 "Y8_1314" ;

. label define ne1s      .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy" ;

. label define ne2s      .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy" ;

. label define ne3s      .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy" ;

. label define ne4s      .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy" ;

. label define ne5s      .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy" ;

. label define ne6s      .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy" ;

. label define ne7s      .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy" ;

. label define us1s      .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy" ;

. label define us2s      .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy" ;

. label define us3s      .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy" ;

. label define us4s      .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy" ;

. label define us5s      .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy" ;

. label define us5as     .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy" ;

. label define us6s      .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy" ;

. label define us7s      .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy" ;

. label define us8s      .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy" ;

. label define us9s      .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy" ;

. label define us10s     .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy" ;

. label define us11s     .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy" ;

. label define us12s     .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy" ;

. label define us13s     .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy" ;

. label define us14s     .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "strong policy" ;

. label define us15s     .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "strong policy" ;

. label define ng1s      .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy provision" 1 "Weak policy"
>                        2 "Strong policy" ;

. label define ng2s      .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy provision" 1 "Weak policy"
>                        2 "Strong policy" ;

. label define ng2sds    0 "Applies at all times or SD not specified"
>                        1 "Applies only during the SD" ;

. label define ng3s      .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy provision" 1 "Weak policy"
>                        2 "Strong policy" ;

. label define ng3sds    0 "Applies at all times or SD not specified"
>                        1 "Applies only during the SD" ;

. label define ng4s      .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy provision" 1 "Weak policy"
>                        2 "Strong policy" ;

. label define ng4sds    .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "Applies at all times or SD ns"
>                        1 "Only applies during SD" ;

. label define ng5s      .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy provision" 1 "Weak policy"
>                        2 "Strong policy" ;

. label define ng5sds    .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "Applies at all times or SD ns"
>                        1 "Only applies during SD" ;

. label define ng6s      .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy provision" 1 "Weak policy"
>                        2 "Strong policy" ;

. label define ng7s      .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy provision" 1 "Weak policy"
>                        2 "Strong policy" ;

. label define ng8s      .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy provision" 1 "Weak policy"
>                        2 "Strong policy" ;

. label define ng9s      .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy provision" 1 "Weak policy"
>                        2 "Strong policy" ;

. label define ng10s     .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy"
>                        4 "Bans vending or all competitive foods & beverages" ;

. label define ng10sds   0 "Applies at all times or SD not specified"
>                        1 "Applies only during the SD" ;

. label define ng16vms   .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy: < IOM Standard"
>                        3 "Strong policy: Meets IOM Standard"
>                        4 "Ban vending or competitive foods" ;

. label define ng16vmsds .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "Applies at all times or SD ns"
>                        1 "Only applies during SD" ;

. label define ng17vms   .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy" 4 "Ban vending or competitive foods" ;

. label define ng17vmsds .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "Applies at all times or SD ns"
>                        1 "Only applies during SD" ;

. label define ng18vms   .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy: < IOM Standard"
>                        3 "Strong policy: Meets IOM Standard"
>                        4 "Ban vending or competitive foods" ;

. label define ng18vmsds .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "Applies at all times or SD ns"
>                        1 "Only applies during SD" ;

. label define ng19vms   .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy: < IOM Standard"
>                        3 "Strong policy: Meets IOM Standard"
>                        4 "Ban vending or competitive foods" ;

. label define ng19vmsds .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "Applies at all times or SD ns"
>                        1 "Only applies during SD" ;

. label define ng20vms   .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy: < IOM Standard"
>                        3 "Strong policy: Meets IOM Standard"
>                        4 "Ban vending or competitive foods" ;

. label define ng20vmsds .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "Applies at all times or SD ns"
>                        1 "Only applies during SD" ;

. label define ng21vms   .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy: < IOM Standard"
>                        3 "Strong policy: Meets IOM Standard"
>                        4 "Ban vending or competitive foods" ;

. label define ng21vmsds .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "Applies at all times or SD ns"
>                        1 "Only applies during SD" ;

. label define ng22vms   .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy"
>                        3 "Strong policy: Meets IOM standard"
>                        4 "Ban vending or competitive beverages" ;

. label define ng22vmsds .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "Applies at all times or SD ns"
>                        1 "Only applies during SD" ;

. label define ng23vms   .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy"
>                        4 "Ban vending or competitive beverages" ;

. label define ng23vmsds .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "Applies at all times or SD ns"
>                        1 "Only applies during SD" ;

. label define ng24vms   .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy: < IOM Standard"
>                        3 "Strong policy: Meets IOM Standard"
>                        4 "Ban vending or competitive beverages" ;

. label define ng24vmsds .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "Applies at all times or SD ns"
>                        1 "Only applies during SD" ;

. label define ng25vms   .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy"
>                        3 "Strong policy: Meets IOM standard"
>                        4 "Ban vending or competitive beverages" ;

. label define ng25vmsds .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "Applies at all times or SD ns"
>                        1 "Only applies during SD" ;

. label define ng26vms   .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy: < IOM Standard"
>                        3 "Strong policy: Meets IOM Standard"
>                        4 "Bans vending or competitive beverages" ;

. label define ng26vmsds .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "Applies at all times or SD ns"
>                        1 "Only applies during SD" ;

. label define ng27vms   .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy"
>                        3 "Strong policy: Meets IOM Standard"
>                        4 "Ban vending or competitive beverages" ;

. label define ng27vmsds .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "Applies at all times or SD ns"
>                        1 "Only applies during SD" ;

. label define ng28vms   .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy: < IOM Standard"
>                        3 "Strong policy: Meets IOM Standard"
>                        4 "Ban vending or competitive beverages" ;

. label define ng28vmsds .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "Applies at all times or SD ns"
>                        1 "Only applies during SD" ;

. label define ng29vms   .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy"
>                        3 "Strong policy: Meets IOM Standard"
>                        4 "Ban vending or competitive beverages" ;

. label define ng30vms   .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy"
>                        3 "Strong policy: Meets IOM Standard"
>                        4 "Ban competitive beverages" ;

. label define ng30vmsds .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy"
>                        3 "Strong policy: Meets IOM Standard"
>                        4 "Ban competitive beverages" ;

. label define ng29vmsds .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "Applies at all times or SD ns"
>                        1 "Only applies during SD" ;

. label define ng11s     .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy"
>                        4 "Bans stores or all competitive foods & beverages" ;

. label define ng11sds   0 "Applies at all times or SD not specified"
>                        1 "Applies only during the SD" ;

. label define ng16sss   .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy: < IOM Standard"
>                        3 "Strong policy: Meets IOM Standard"
>                        4 "Ban stores or competitive foods" ;

. label define ng16sssds .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "Applies at all times or SD ns"
>                        1 "Only applies during SD" ;

. label define ng17sss   .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy" 4 "Ban stores or competitive foods" ;

. label define ng17sssds .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "Applies at all times or SD ns"
>                        1 "Only applies during SD" ;

. label define ng18sss   .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy: < IOM Standard"
>                        3 "Strong policy: Meets IOM Standard"
>                        4 "Ban stores or competitive foods" ;

. label define ng18sssds .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "Applies at all times or SD ns"
>                        1 "Only applies during SD" ;

. label define ng19sss   .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy: < IOM Standard"
>                        3 "Strong policy: Meets IOM Standard"
>                        4 "Ban stores or competitive foods" ;

. label define ng19sssds .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "Applies at all times or SD ns"
>                        1 "Only applies during SD" ;

. label define ng20sss   .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy: < IOM Standard"
>                        3 "Strong policy: Meets IOM Standard"
>                        4 "Ban stores or competitive foods" ;

. label define ng20sssds .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "Applies at all times or SD ns"
>                        1 "Only applies during SD" ;

. label define ng21sss   .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy: < IOM Standard"
>                        3 "Strong policy: Meets IOM Standard"
>                        4 "Ban stores or competitive foods" ;

. label define ng21sssds .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "Applies at all times or SD ns"
>                        1 "Only applies during SD" ;

. label define ng22sss   .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy"
>                        3 "Strong policy: Meets IOM standard"
>                        4 "Ban stores or competitive beverages" ;

. label define ng22sssds .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "Applies at all times or SD ns"
>                        1 "Only applies during SD" ;

. label define ng23sss   .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy"
>                        4 "Ban stores or competitive beverages" ;

. label define ng23sssds .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "Applies at all times or SD ns"
>                        1 "Only applies during SD" ;

. label define ng24sss   .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy: < IOM Standard"
>                        3 "Strong policy: Meets IOM Standard"
>                        4 "Ban stores or competitive beverages" ;

. label define ng24sssds .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "Applies at all times or SD ns"
>                        1 "Only applies during SD" ;

. label define ng25sss   .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy"
>                        3 "Strong policy: Meets IOM standard"
>                        4 "Ban stores or competitive beverages" ;

. label define ng25sssds .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "Applies at all times or SD ns"
>                        1 "Only applies during SD" ;

. label define ng26sss   .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy: < IOM Standard"
>                        3 "Strong policy: Meets IOM Standard"
>                        4 "Bans stores or competitive beverages" ;

. label define ng26sssds .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "Applies at all times or SD ns"
>                        1 "Only applies during SD" ;

. label define ng27sss   .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy"
>                        3 "Strong policy: Meets IOM Standard"
>                        4 "Ban stores or competitive beverages" ;

. label define ng27sssds .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "Applies at all times or SD ns"
>                        1 "Only applies during SD" ;

. label define ng28sss   .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy: < IOM Standard"
>                        3 "Strong policy: Meets IOM Standard"
>                        4 "Ban stores or competitive beverages" ;

. label define ng28sssds .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "Applies at all times or SD ns"
>                        1 "Only applies during SD" ;

. label define ng29sss   .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy"
>                        3 "Strong policy: Meets IOM Standard"
>                        4 "Ban stores or competitive beverages" ;

. label define ng29sssds .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "Applies at all times or SD ns"
>                        1 "Only applies during SD" ;

. label define ng30sss   .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy"
>                        3 "Strong policy: Meets IOM Standard"
>                        4 "Ban competitive beverages" ;

. label define ng30ssds  .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "Applies at all times or SD ns"
>                        1 "Only applies during SD" ;

. label define ng12s     .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy"
>                        4 "Bans A la carte or all competitive foods & beverages" ;

. label define ng16als   .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy: < IOM Standard"
>                        3 "Strong policy: Meets IOM Standard"
>                        4 "Ban A la carte or competitive foods" ;

. label define ng17als   .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy"
>                        4 "Ban A la carte or competitive foods" ;

. label define ng18als   .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy: < IOM Standard"
>                        3 "Strong policy: Meets IOM Standard"
>                        4 "Ban A la carte or competitive foods" ;

. label define ng19als   .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy: < IOM Standard"
>                        3 "Strong policy: Meets IOM Standard"
>                        4 "Ban A la carte or competitive foods" ;

. label define ng20als   .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy: < IOM Standard"
>                        3 "Strong policy: Meets IOM Standard"
>                        4 "Ban A la carte or competitive foods" ;

. label define ng21als   .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy: < IOM Standard"
>                        3 "Strong policy: Meets IOM Standard"
>                        4 "Ban A la carte or competitive foods" ;

. label define ng22als   .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy"
>                        3 "Strong policy: Meets IOM standard"
>                        4 "Ban A la carte or competitive beverages" ;

. label define ng23als   .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy"
>                        4 "Ban A la carte or competitive beverages" ;

. label define ng24als   .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy: < IOM Standard"
>                        3 "Strong policy: Meets IOM Standard"
>                        4 "Ban A la carte or competitive beverages" ;

. label define ng25als   .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy"
>                        3 "Strong policy: Meets IOM standard"
>                        4 "Ban A la carte or competitive beverages" ;

. label define ng26als   .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy: < IOM Standard"
>                        3 "Strong policy: Meets IOM Standard"
>                        4 "Bans A la carte or competitive beverages" ;

. label define ng27als   .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy"
>                        3 "Strong policy: Meets IOM Standard"
>                        4 "Ban A la carte or competitive beverages" ;

. label define ng28als   .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy: < IOM Standard"
>                        3 "Strong policy: Meets IOM Standard"
>                        4 "Ban A la carte or competitive beverages" ;

. label define ng29als   .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy"
>                        3 "Strong policy: Meets IOM Standard"
>                        4 "Ban A la carte or competitive beverages" ;

. label define ng30als   .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy"
>                        3 "Strong policy: Meets IOM Standard"
>                        4 "Ban competitive beverages" ;

. label define ng13s     .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy"
>                        4 "Bans competitive foods & beverages" ;

. label define ng16cps   .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy: < IOM Standard"
>                        3 "Strong policy: Meets IOM Standard"
>                        4 "Ban competitive foods" ;

. label define ng17cps   .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy" 4 "Ban competitive foods" ;

. label define ng18cps   .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy: < IOM Standard"
>                        3 "Strong policy: Meets IOM Standard"
>                        4 "Ban competitive foods" ;

. label define ng19cps   .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy: < IOM Standard"
>                        3 "Strong policy: Meets IOM Standard"
>                        4 "Ban competitive foods" ;

. label define ng20cps   .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy: < IOM Standard"
>                        3 "Strong policy: Meets IOM Standard"
>                        4 "Ban competitive foods" ;

. label define ng21cps   .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy: < IOM Standard"
>                        3 "Strong policy: Meets IOM Standard"
>                        4 "Ban competitive foods" ;

. label define ng22cps   .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy"
>                        3 "Strong policy: Meets IOM standard"
>                        4 "Ban competitive beverages" ;

. label define ng23cps   .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy" 4 "Ban competitive beverages" ;

. label define ng24cps   .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy: < IOM Standard"
>                        3 "Strong policy: Meets IOM Standard"
>                        4 "Ban competitive beverages" ;

. label define ng25cps   .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy"
>                        3 "Strong policy: Meets IOM standard"
>                        4 "Ban competitive beverages" ;

. label define ng26cps   .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy: < IOM Standard"
>                        3 "Strong policy: Meets IOM Standard"
>                        4 "Bans class parties or competitive beverages" ;

. label define ng27cps   .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy"
>                        3 "Strong policy: Meets IOM Standard"
>                        4 "Ban competitive beverages" ;

. label define ng28cps   .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy: < IOM Standard"
>                        3 "Strong policy: Meets IOM Standard"
>                        4 "Ban competitive beverages" ;

. label define ng29cps   .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy"
>                        3 "Strong policy: Meets IOM Standard"
>                        4 "Ban competitive beverages" ;

. label define ng14s     .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy"
>                        4 "Bans competitive foods & beverages" ;

. label define ng16evs   .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy: < IOM Standard"
>                        3 "Strong policy: Meets IOM Standard"
>                        4 "Ban competitive foods" ;

. label define ng17evs   .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy" 4 "Ban competitive foods" ;

. label define ng18evs   .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy: < IOM Standard"
>                        3 "Strong policy: Meets IOM Standard"
>                        4 "Ban competitive foods" ;

. label define ng19evs   .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy: < IOM Standard"
>                        3 "Strong policy: Meets IOM Standard"
>                        4 "Ban competitive foods" ;

. label define ng20evs   .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy: < IOM Standard"
>                        3 "Strong policy: Meets IOM Standard"
>                        4 "Ban competitive foods" ;

. label define ng21evs   .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy: < IOM Standard"
>                        3 "Strong policy: Meets IOM Standard"
>                        4 "Ban competitive foods" ;

. label define ng22evs   .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy"
>                        3 "Strong policy: Meets IOM standard"
>                        4 "Ban competitive beverages" ;

. label define ng23evs   .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy" 4 "Ban competitive beverages" ;

. label define ng24evs   .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy: < IOM Standard"
>                        3 "Strong policy: Meets IOM Standard"
>                        4 "Ban competitive beverages" ;

. label define ng25evs   .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy"
>                        3 "Strong policy: Meets IOM standard"
>                        4 "Ban competitive beverages" ;

. label define ng26evs   .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy: < IOM Standard"
>                        3 "Strong policy: Meets IOM Standard"
>                        4 "Bans evening community events or competitive beverages" ;

. label define ng27evs   .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy"
>                        3 "Strong policy: Meets IOM Standard"
>                        4 "Ban competitive beverages" ;

. label define ng28evs   .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy: <IOM Standard"
>                        3 "Strong policy: Meets IOM Standard"
>                        4 "Ban competitive beverages" ;

. label define ng29evs   .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy"
>                        3 "Strong policy: Meets IOM Standard"
>                        4 "Ban competitive beverages" ;

. label define ng15s     .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy"
>                        4 "Bans competitive foods & beverages" ;

. label define ng15s_old .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy"
>                        4 "Bans competitive foods & beverages" ;

. label define ng15sds   0 "Applies at all times or SD not specified"
>                        1 "Applies only during the SD" ;

. label define ng16frs   .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy: < IOM Standard"
>                        3 "Strong policy: Meets IOM Standard"
>                        4 "Ban competitive foods" ;

. label define ng16frsds .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "Applies at all times or SD ns"
>                        1 "Only applies during SD" ;

. label define ng17frs   .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy" 4 "Ban competitive foods" ;

. label define ng17frsds .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "Applies at all times or SD ns"
>                        1 "Only applies during SD" ;

. label define ng18frs   .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy: < IOM Standard"
>                        3 "Strong policy: Meets IOM Standard"
>                        4 "Ban competitive foods" ;

. label define ng18frsds .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "Applies at all times or SD ns"
>                        1 "Only applies during SD" ;

. label define ng19frs   .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy: < IOM Standard"
>                        3 "Strong policy: Meets IOM Standard"
>                        4 "Ban competitive foods" ;

. label define ng19frsds .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "Applies at all times or SD ns"
>                        1 "Only applies during SD" ;

. label define ng20frs   .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy: < IOM Standard"
>                        3 "Strong policy: Meets IOM Standard"
>                        4 "Ban competitive foods" ;

. label define ng20frsds .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "Applies at all times or SD ns"
>                        1 "Only applies during SD" ;

. label define ng21frs   .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy: < IOM Standard"
>                        3 "Strong policy: Meets IOM Standard"
>                        4 "Ban competitive foods" ;

. label define ng21frsds .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "Applies at all times or SD ns"
>                        1 "Only applies during SD" ;

. label define ng22frs   .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy"
>                        3 "Strong policy: Meets IOM standard"
>                        4 "Ban competitive beverages" ;

. label define ng22frsds .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "Applies at all times or SD ns"
>                        1 "Only applies during SD" ;

. label define ng23frs   .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy" 4 "Ban competitive beverages" ;

. label define ng23frsds .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "Applies at all times or SD ns"
>                        1 "Only applies during SD" ;

. label define ng24frs   .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy: < IOM Standard"
>                        3 "Strong policy: Meets IOM Standard"
>                        4 "Ban competitive beverages" ;

. label define ng24frsds .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "Applies at all times or SD ns"
>                        1 "Only applies during SD" ;

. label define ng25frs   .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy"
>                        3 "Strong policy: Meets IOM standard"
>                        4 "Ban competitive beverages" ;

. label define ng25frsds .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "Applies at all times or SD ns"
>                        1 "Only applies during SD" ;

. label define ng26frs   .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy: < IOM Standard"
>                        3 "Strong policy: Meets IOM Standard"
>                        4 "Bans fundraisers or competitive beverages" ;

. label define ng26frsds .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "Applies at all times or SD ns"
>                        1 "Only applies during SD" ;

. label define ng27frs   .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy"
>                        3 "Strong policy: Meets IOM Standard"
>                        4 "Ban competitive beverages" ;

. label define ng27frsds .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "Applies at all times or SD ns"
>                        1 "Only applies during SD" ;

. label define ng28frs   .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy: < IOM Standard"
>                        3 "Strong policy: Meets IOM Standard"
>                        4 "Ban competitive beverages" ;

. label define ng28frsds .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "Applies at all times or SD ns"
>                        1 "Only applies during SD" ;

. label define ng29frs   .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy"
>                        3 "Strong policy: Meets IOM Standard"
>                        4 "Ban competitive beverages" ;

. label define ng29frsds .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "Applies at all times or SD ns"
>                        1 "Only applies during SD" ;

. label define pe1s      .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Yes addresses PE"
>                        2 "Strong policy" ;

. label define pe2s      .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy" ;

. label define pe3s      .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy: Meets NASPE standard" ;

. label define pe4s      .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy: Meets NASPE standard" ;

. label define pe5s      .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy: Meets NASPE standard" ;

. label define pe6s      .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy" ;

. label define pe7s      .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy" ;

. label define pe8s      .n "Not Applicable" 
>                        .g "Grade level NA"
>                        .c "Variable does not apply to grade level"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy" ;

. label define pe9s      .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy" ;

. label define pe9as     .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "Not mentioned"
>                        1 "Allows school Districts to apply for waiver" ;

. label define pe10s     .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy" ;

. label define pe11s     .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy" ;

. label define pe12s     .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy" ;

. label define pe13s     .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy" ;

. label define pe14s     .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy" ;

. label define pe15s     .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy" ;

. label define pe16s     .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy" ;

. label define pe17s     .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "strong policy" ;

. label define pa1s      .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy" ;

. label define pa2s      .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy" ;

. label define pa3s      .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy" ;

. label define pa3bs     .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No" 1 "Yes" ;

. label define pa3cs     .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No" 1 "Yes" ;

. label define pa4s      .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy" ;

. label define pa5s      .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy" ;

. label define pa6s      .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy" ;

. label define pa7s      .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy" ;

. label define pa8s      .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy" ;

. label define pa9s      .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy" ;

. label define pa10s     .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "strong policy" ;

. label define pa11s     .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "strong policy" ;

. label define st1s      .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy" ;

. label define st2s      .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy" ;

. label define st3s      .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy" ;

. label define cp1s      .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy" ;

. label define cp2s      .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy" ;

. label define cp3s      .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy" ;

. label define cp4s      .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "strong policy" ;

. label define cp5s      .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "strong policy" ;

. label define mp1s      .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy" ;

. label define mp2s      .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy" ;

. label define mp3s      .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy" ;

. label define e1s       .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy" ;

. label define e2s       .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy" ;

. label define e3s       .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy" ;

. label define e4s_new   .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision"
>                        1 "BMI suggested encouraged or phased-in requirement"
>                        2 "bmi measurement applies to some but not all grades"
>                        3 "bmi measurement required no reporting"
>                        4 "bmi measurement required with reporting" ;

. label define e5s       .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy" ;

. label define e6s       .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy" ;

. label define e7s       .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy" ;

. label define e8s       .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy" ;

. label define e12s      .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "No policy or provision" 1 "Weak policy"
>                        2 "Strong policy" ;

. label define e13s      .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "Not addressed No policy" 1 "Suggested" 2 "Required" ;

. label define e14s      .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "Not addressed No policy" 1 "Suggested" 2 "Required" ;

. label define e15s      .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "Not addressed No policy" 1 "Suggested" 2 "Required" ;

. label define e16s      .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "Not addressed No policy" 1 "Suggested" 2 "Required" ;

. label define e17s      .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "Not addressed No policy" 1 "Suggested" 2 "Required" ;

. label define r1s       .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "Not addressed No policy" 1 "Suggested" 2 "Required" ;

. label define r2s       .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "Not addressed No policy" 1 "Suggested" 2 "Required" ;

. label define r3s       .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "Not addressed No policy" 1 "Suggested" 2 "Required" ;

. label define r3ss      .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "Not addressed No policy" 1 "Suggested" 2 "Required" ;

. label define r4s       .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "Not addressed No policy" 1 "Suggested" 2 "Required" ;

. label define r5s       .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "Not addressed No policy" 1 "Suggested" 2 "Required" ;

. label define r6s       .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "Not addressed No policy" 1 "Suggested" 2 "Required" ;

. label define r7s       .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "Not addressed No policy" 1 "Suggested" 2 "Required" ;

. label define r8s       .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "Not addressed No policy" 1 "Suggested" 2 "Required" ;

. label define r9s       .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "Not addressed No policy" 1 "Suggested" 2 "Required" ;

. label define r10s      .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "Not addressed No policy" 1 "Suggested" 2 "Required" ;

. label define r11s      .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "Not addressed No policy" 1 "Suggested" 2 "Required" ;

. label define r12s      .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "Not addressed No policy" 1 "Suggested" 2 "Required" ;

. label define r13s      .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "Not addressed No policy" 1 "Suggested" 2 "Required" ;

. label define r14s      .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "Not addressed No policy" 1 "Suggested" 2 "Required" ;

. label define r15s      .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "Not addressed No policy" 1 "Suggested" 2 "Required" ;

. label define r16s      .n "Not Applicable" 
>                        .g "Grade level NA" .c "Not coded in given year"
>                        0 "Not addressed No policy" 1 "Suggested" 2 "Required" ;

. label define northeast 0 "No" 1 "Yes" ;

. label define midwest   0 "No" 1 "Yes" ;

. label define south     0 "No" 1 "Yes" ;

. label define west      0 "No" 1 "Yes" ;

. label define region    1 "West" 2 "Midwest" 3 "South" 4 "Northeast" ;

. label define newengland 0 "No" 1 "Yes" ;

. label define midatlantic 0 "No" 1 "Yes" ;

. label define eastnorcen 0 "No" 1 "Yes" ;

. label define wesnorcen 0 "No" 1 "Yes" ;

. label define southatl  0 "No" 1 "Yes" ;

. label define eastsocen 0 "No" 1 "Yes" ;

. label define westsocen 0 "No" 1 "Yes" ;

. label define mountain  0 "No" 1 "Yes" ;

. label define pacific   0 "No" 1 "Yes" ;

. label define division  1 "New England (1)" 2 "Middle Atlantic (2)"
>                        3 "East North Central (3)" 4 "West North Central (4)"
>                        5 "South Atlantic (5)" 6 "East South Central (6)"
>                        7 "West South Central (7)" 8 "Mountain (8)"
>                        9 "Pacific (9)" ;

. #delimit cr
delimiter now cr
. 
. save_data "`derived_dir'/btg_state.dta", key(fipstnum gradelevel year) replace nopreserve
(data now sorted by fipstnum gradelevel year)
fipstnum was int now byte
year was int now byte
gradelevelnumeric was int now byte
es was int now byte
ms was int now byte
hs was int now byte
ne1s was int now byte
ne2s was int now byte
ne3s was int now byte
ne4s was int now byte
ne5s was int now byte
ne6s was int now byte
ne7s was int now byte
us1s was int now byte
us2s was int now byte
us3s was int now byte
us4s was int now byte
us5s was int now byte
us5as was int now byte
us6s was int now byte
us7s was int now byte
us8s was int now byte
us9s was int now byte
us10s was int now byte
us11s was int now byte
us12s was int now byte
us13s was int now byte
us14s was int now byte
us15s was int now byte
ng1s was int now byte
ng2s was int now byte
ng2sds was int now byte
ng3s was int now byte
ng3sds was int now byte
ng4s was int now byte
ng4sds was int now byte
ng5s was int now byte
ng5sds was int now byte
ng6s was int now byte
ng7s was int now byte
ng8s was int now byte
ng9s was int now byte
ng10s was int now byte
ng10sds was int now byte
ng16vms was int now byte
ng16vmsds was int now byte
ng17vms was int now byte
ng17vmsds was int now byte
ng18vms was int now byte
ng18vmsds was int now byte
ng19vms was int now byte
ng19vmsds was int now byte
ng20vms was int now byte
ng20vmsds was int now byte
ng21vms was int now byte
ng21vmsds was int now byte
ng22vms was int now byte
ng22vmsds was int now byte
ng23vms was int now byte
ng23vmsds was int now byte
ng24vms was int now byte
ng24vmsds was int now byte
ng25vms was int now byte
ng25vmsds was int now byte
ng26vms was int now byte
ng26vmsds was int now byte
ng27vms was int now byte
ng27vmsds was int now byte
ng28vms was int now byte
ng28vmsds was int now byte
ng29vms was int now byte
ng30vms was int now byte
ng30vmsds was int now byte
ng29vmsds was int now byte
ng11s was int now byte
ng11sds was int now byte
ng16sss was int now byte
ng16sssds was int now byte
ng17sss was int now byte
ng17sssds was int now byte
ng18sss was int now byte
ng18sssds was int now byte
ng19sss was int now byte
ng19sssds was int now byte
ng20sss was int now byte
ng20sssds was int now byte
ng21sss was int now byte
ng21sssds was int now byte
ng22sss was int now byte
ng22sssds was int now byte
ng23sss was int now byte
ng23sssds was int now byte
ng24sss was int now byte
ng24sssds was int now byte
ng25sss was int now byte
ng25sssds was int now byte
ng26sss was int now byte
ng26sssds was int now byte
ng27sss was int now byte
ng27sssds was int now byte
ng28sss was int now byte
ng28sssds was int now byte
ng29sss was int now byte
ng29sssds was int now byte
ng30sss was int now byte
ng30ssds was int now byte
ng12s was int now byte
ng16als was int now byte
ng17als was int now byte
ng18als was int now byte
ng19als was int now byte
ng20als was int now byte
ng21als was int now byte
ng22als was int now byte
ng23als was int now byte
ng24als was int now byte
ng25als was int now byte
ng26als was int now byte
ng27als was int now byte
ng28als was int now byte
ng29als was int now byte
ng30als was int now byte
ng13s was int now byte
ng16cps was int now byte
ng17cps was int now byte
ng18cps was int now byte
ng19cps was int now byte
ng20cps was int now byte
ng21cps was int now byte
ng22cps was int now byte
ng23cps was int now byte
ng24cps was int now byte
ng25cps was int now byte
ng26cps was int now byte
ng27cps was int now byte
ng28cps was int now byte
ng29cps was int now byte
ng14s was int now byte
ng16evs was int now byte
ng17evs was int now byte
ng18evs was int now byte
ng19evs was int now byte
ng20evs was int now byte
ng21evs was int now byte
ng22evs was int now byte
ng23evs was int now byte
ng24evs was int now byte
ng25evs was int now byte
ng26evs was int now byte
ng27evs was int now byte
ng28evs was int now byte
ng29evs was int now byte
ng15s was int now byte
ng15s_old was int now byte
ng15sds was int now byte
ng16frs was int now byte
ng16frsds was int now byte
ng17frs was int now byte
ng17frsds was int now byte
ng18frs was int now byte
ng18frsds was int now byte
ng19frs was int now byte
ng19frsds was int now byte
ng20frs was int now byte
ng20frsds was int now byte
ng21frs was int now byte
ng21frsds was int now byte
ng22frs was int now byte
ng22frsds was int now byte
ng23frs was int now byte
ng23frsds was int now byte
ng24frs was int now byte
ng24frsds was int now byte
ng25frs was int now byte
ng25frsds was int now byte
ng26frs was int now byte
ng26frsds was int now byte
ng27frs was int now byte
ng27frsds was int now byte
ng28frs was int now byte
ng28frsds was int now byte
ng29frs was int now byte
ng29frsds was int now byte
pe1s was int now byte
pe2s was int now byte
pe3s was int now byte
pe4s was int now byte
pe5s was int now byte
pe6s was int now byte
pe7s was int now byte
pe8s was int now byte
pe9s was int now byte
pe9as was int now byte
pe10s was int now byte
pe11s was int now byte
pe12s was int now byte
pe13s was int now byte
pe14s was int now byte
pe15s was int now byte
pe16s was int now byte
pe17s was int now byte
pa1s was int now byte
pa2s was int now byte
pa3s was int now byte
pa3bs was int now byte
pa3cs was int now byte
pa4s was int now byte
pa5s was int now byte
pa6s was int now byte
pa7s was int now byte
pa8s was int now byte
pa9s was int now byte
pa10s was int now byte
pa11s was int now byte
st1s was int now byte
st2s was int now byte
st3s was int now byte
cp1s was int now byte
cp2s was int now byte
cp3s was int now byte
cp4s was int now byte
cp5s was int now byte
mp1s was int now byte
mp2s was int now byte
mp3s was int now byte
e1s was int now byte
e2s was int now byte
e3s was int now byte
e4s_new was int now byte
e5s was int now byte
e6s was int now byte
e7s was int now byte
e8s was int now byte
e12s was int now byte
e13s was int now byte
e14s was int now byte
e15s was int now byte
e16s was int now byte
e17s was int now byte
r1s was int now byte
r2s was int now byte
r3s was int now byte
r3ss was int now byte
r4s was int now byte
r5s was int now byte
r6s was int now byte
r7s was int now byte
r8s was int now byte
r9s was int now byte
r10s was int now byte
r11s was int now byte
r12s was int now byte
r13s was int now byte
r14s was int now byte
r15s was int now byte
r16s was int now byte
northeast was int now byte
midwest was int now byte
south was int now byte
west was int now byte
region was int now byte
newengland was int now byte
midatlantic was int now byte
eastnorcen was int now byte
wesnorcen was int now byte
southatl was int now byte
eastsocen was int now byte
westsocen was int now byte
mountain was int now byte
pacific was int now byte
division was int now byte
==================================================================================================
File: C:/Users/Samuele/Google Drive/research projects/obesity/derived/bridging_the_gap/state/btg_state.dta
Key: fipstnum gradelevel year
==================================================================================================
  1224:275(55219):1427932164:1202683710

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
    fipstnum |      1224    28.96078    15.68324          1         56
  gradelevel |         0
        year |      1224         4.5    2.292224          1          8
       fipst |         0
      stname |         0
-------------+--------------------------------------------------------
    stabbrev |         0
gradelevel~c |      1224           2    .8168303          1          3
          es |      1224    .3333333    .4715972          0          1
          ms |      1224    .3333333    .4715972          0          1
          hs |      1224    .3333333    .4715972          0          1
-------------+--------------------------------------------------------
        ne1s |      1224    1.681373    .7141459          0          2
        ne2s |      1224    1.251634    .8666138          0          2
        ne3s |       918    .1437908    .3779928          0          2
        ne4s |      1224    .2303922    .5342171          0          2
        ne5s |      1224    .1985294    .5262973          0          2
-------------+--------------------------------------------------------
        ne6s |      1224     1.34232    .9004259          0          2
        ne7s |      1224    .3210784    .4670817          0          1
        us1s |      1224    1.042484    .9995055          0          2
        us2s |      1224    1.077614    .8949877          0          2
        us3s |      1224     .499183    .8178303          0          2
-------------+--------------------------------------------------------
        us4s |      1224     .125817    .3864256          0          2
        us5s |      1224     .252451    .5477917          0          2
       us5as |      1224    .0522876     .275244          0          2
        us6s |       306    .0849673    .2792898          0          1
        us7s |      1224    .3978758    .6515812          0          2
-------------+--------------------------------------------------------
        us8s |      1224    .2671569     .509629          0          2
        us9s |      1224    .0522876    .2868808          0          2
       us10s |      1224     .370098    .4980301          0          2
       us11s |       765    .5647059    .8832702          0          2
       us12s |       765    .4745098     .849047          0          2
-------------+--------------------------------------------------------
       us13s |       765    .2496732    .6585249          0          2
       us14s |       459    .0915033    .3857643          0          2
       us15s |       306    .1372549    .5064673          0          2
        ng1s |      1224    .9738562     .845924          0          2
        ng2s |      1224    .0612745    .2893651          0          2
-------------+--------------------------------------------------------
      ng2sds |      1224    .0098039    .0985685          0          1
        ng3s |      1224    .3218954    .6845887          0          2
      ng3sds |      1224    .0571895    .2322993          0          1
        ng4s |      1224    .0196078    .1387051          0          1
      ng4sds |       918           0           0          0          0
-------------+--------------------------------------------------------
        ng5s |       918           0           0          0          0
      ng5sds |       918           0           0          0          0
        ng6s |      1224    .3995098    .5497637          0          2
        ng7s |      1224    .0800654    .3550288          0          2
        ng8s |      1224    .0947712    .3761127          0          2
-------------+--------------------------------------------------------
        ng9s |      1224     .127451    .4467724          0          2
       ng10s |      1224    .8218954    .9217873          0          4
     ng10sds |      1224    .3831699    .4863579          0          1
     ng16vms |       918    .9052288    1.232403          0          4
   ng16vmsds |       918    .3148148    .4646953          0          1
-------------+--------------------------------------------------------
     ng17vms |       918    .4684096    .9494209          0          4
   ng17vmsds |       918    .1666667    .3728811          0          1
     ng18vms |       918    .9466231     1.20901          0          4
   ng18vmsds |       918    .3474946     .476434          0          1
     ng19vms |       918    .7178649    1.227603          0          4
-------------+--------------------------------------------------------
   ng19vmsds |       918    .2135076    .4100064          0          1
     ng20vms |       918     .503268     1.07995          0          4
   ng20vmsds |       918    .1481481    .3554404          0          1
     ng21vms |       918    .7189542     1.26848          0          4
   ng21vmsds |       918    .1971678    .3980769          0          1
-------------+--------------------------------------------------------
     ng22vms |       918    .7440087    1.180929          0          4
   ng22vmsds |       918    .2636166    .4408339          0          1
     ng23vms |       918    .3616558    .8798795          0          4
   ng23vmsds |       918    .1601307    .3669272          0          1
     ng24vms |       918    1.122004    1.239277          0          4
-------------+--------------------------------------------------------
   ng24vmsds |       918    .3671024    .4822775          0          1
     ng25vms |       918     .664488    1.194618          0          4
   ng25vmsds |       918    .1960784     .397245          0          1
     ng26vms |       918    .5174292    1.022762          0          4
   ng26vmsds |       918    .1546841    .3618004          0          1
-------------+--------------------------------------------------------
     ng27vms |       918    .7625272    1.267938          0          4
   ng27vmsds |       918    .2265795    .4188464          0          1
     ng28vms |       918    .6154684    .9634885          0          4
   ng28vmsds |       918     .288671    .4533917          0          1
     ng29vms |       918     .795207    1.326477          0          4
-------------+--------------------------------------------------------
     ng30vms |       459     .832244    1.193215          0          4
   ng30vmsds |       459    .3115468     .463631          0          1
   ng29vmsds |       918    .1960784     .397245          0          1
       ng11s |      1224    .7312092    .8843917          0          4
     ng11sds |      1224    .3619281    .4807546          0          1
-------------+--------------------------------------------------------
     ng16sss |       918    .7810458    1.147274          0          4
   ng16sssds |       918    .3191721      .46641          0          1
     ng17sss |       918    .3769063    .8072669          0          4
   ng17sssds |       918    .1557734    .3628381          0          1
     ng18sss |       918    .8224401    1.126685          0          4
-------------+--------------------------------------------------------
   ng18sssds |       918    .3551198    .4788105          0          1
     ng19sss |       918    .5642702     1.09709          0          4
   ng19sssds |       918     .208061     .406142          0          1
     ng20sss |       918    .3986928    .9456774          0          4
   ng20sssds |       918    .1459695    .3532681          0          1
-------------+--------------------------------------------------------
     ng21sss |       918    .5751634    1.167683          0          4
   ng21sssds |       918    .1819172    .3859866          0          1
     ng22sss |       918    .6525054    1.111136          0          4
   ng22sssds |       918    .2668845    .4425726          0          1
     ng23sss |       918    .3093682    .8156989          0          4
-------------+--------------------------------------------------------
   ng23sssds |       918    .1492375    .3565166          0          1
     ng24sss |       918    .9814815    1.201002          0          4
   ng24sssds |       918    .3485839    .4767817          0          1
     ng25sss |       918    .5664488    1.119592          0          4
   ng25sssds |       918    .1938998    .3955668          0          1
-------------+--------------------------------------------------------
     ng26sss |       918    .4651416    .9697634          0          4
   ng26sssds |       918    .1525054    .3597061          0          1
     ng27sss |       918    .7102397    1.246554          0          4
   ng27sssds |       918    .2309368    .4216618          0          1
     ng28sss |       918    .5566449    .9131025          0          4
-------------+--------------------------------------------------------
   ng28sssds |       918    .2930283    .4553994          0          1
     ng29sss |       918    .6906318    1.254931          0          4
   ng29sssds |       918    .2004357    .4005446          0          1
     ng30sss |       459    .7407407    1.131282          0          4
    ng30ssds |       459    .3267974    .4695543          0          1
-------------+--------------------------------------------------------
       ng12s |      1224    .8839869     .870863          0          4
     ng16als |       918    .7244009    1.088892          0          4
     ng17als |       918    .4934641    .7409658          0          4
     ng18als |       918    .7984749    1.097095          0          4
     ng19als |       918    .6230937     1.10298          0          4
-------------+--------------------------------------------------------
     ng20als |       918    .3420479    .8345046          0          4
     ng21als |       918    .4956427    1.058529          0          4
     ng22als |       918    .7124183    1.136333          0          4
     ng23als |       918    .3017429    .7641199          0          4
     ng24als |       918    1.354031    1.179588          0          4
-------------+--------------------------------------------------------
     ng25als |       918    .6263617    1.149103          0          4
     ng26als |       918    .4586057    .9339863          0          4
     ng27als |       918    .7440087    1.248267          0          4
     ng28als |       918    .5642702    .8957114          0          4
     ng29als |       918    .7668845    1.290056          0          4
-------------+--------------------------------------------------------
     ng30als |       459    .8300654    1.166064          0          4
       ng13s |      1224    .1993464    .4515436          0          2
     ng16cps |       918    .2091503    .6384987          0          3
     ng17cps |       918    .0784314    .3340916          0          2
     ng18cps |       918    .1797386    .5214516          0          2
-------------+--------------------------------------------------------
     ng19cps |       918    .1339869    .5411321          0          3
     ng20cps |       918    .1078431    .4834485          0          3
     ng21cps |       918    .1045752    .5200042          0          3
     ng22cps |       918    .1176471     .449517          0          3
     ng23cps |       918           0           0          0          0
-------------+--------------------------------------------------------
     ng24cps |       918    .2026144    .6037991          0          3
     ng25cps |       918    .0915033    .4258723          0          3
     ng26cps |       918    .0588235    .3077046          0          2
     ng27cps |       918    .1503268    .5150461          0          3
     ng28cps |       918    .1143791    .3662272          0          3
-------------+--------------------------------------------------------
     ng29cps |       918    .2091503    .7066001          0          3
       ng14s |       765    .0117647    .1078959          0          1
     ng16evs |       459           0           0          0          0
     ng17evs |       459           0           0          0          0
     ng18evs |       459           0           0          0          0
-------------+--------------------------------------------------------
     ng19evs |       459           0           0          0          0
     ng20evs |       459           0           0          0          0
     ng21evs |       459           0           0          0          0
     ng22evs |       459           0           0          0          0
     ng23evs |       459           0           0          0          0
-------------+--------------------------------------------------------
     ng24evs |       459           0           0          0          0
     ng25evs |       459           0           0          0          0
     ng26evs |       459           0           0          0          0
     ng27evs |       459           0           0          0          0
     ng28evs |       459           0           0          0          0
-------------+--------------------------------------------------------
     ng29evs |       459           0           0          0          0
       ng15s |       918    .5130719     .833685          0          4
   ng15s_old |       306    .3006536    .5002946          0          2
     ng15sds |      1224    .3031046    .4597879          0          1
     ng16frs |       918    .5686275    1.059401          0          4
-------------+--------------------------------------------------------
   ng16frsds |       918    .2418301    .4284253          0          1
     ng17frs |       918    .2135076    .7114521          0          4
   ng17frsds |       918    .1034858    .3047584          0          1
     ng18frs |       918    .5610022    .9984087          0          4
   ng18frsds |       918     .254902    .4360437          0          1
-------------+--------------------------------------------------------
     ng19frs |       918    .4281046      .94837          0          4
   ng19frsds |       918    .1862745    .3895403          0          1
     ng20frs |       918    .3267974    .8774161          0          4
   ng20frsds |       918    .1176471    .3223654          0          1
     ng21frs |       918    .4215686    1.014536          0          4
-------------+--------------------------------------------------------
   ng21frsds |       918    .1470588    .3543576          0          1
     ng22frs |       918    .4945534      .97486          0          4
   ng22frsds |       918     .254902    .4360437          0          1
     ng23frs |       918    .1339869    .5589752          0          4
   ng23frsds |       918    .0751634    .2637985          0          1
-------------+--------------------------------------------------------
     ng24frs |       918    .6535948    1.104093          0          4
   ng24frsds |       918    .2810458    .4497548          0          1
     ng25frs |       918    .4389978    .9729627          0          4
   ng25frsds |       918    .2124183    .4092422          0          1
     ng26frs |       918     .288671    .7845997          0          4
-------------+--------------------------------------------------------
   ng26frsds |       918    .1296296    .3360786          0          1
     ng27frs |       918    .4803922    1.017377          0          4
   ng27frsds |       918    .2124183    .4092422          0          1
     ng28frs |       918    .3932462    .7891288          0          4
   ng28frsds |       918    .2363834    .4250919          0          1
-------------+--------------------------------------------------------
     ng29frs |       918    .6013072    1.171303          0          4
   ng29frsds |       918    .2309368    .4216618          0          1
        pe1s |      1224    .9689542    .1735123          0          1
        pe2s |      1224    1.469771    .6538655          0          2
        pe3s |       408    .5588235    .6734491          0          2
-------------+--------------------------------------------------------
        pe4s |       408     .379902    .5341304          0          2
        pe5s |       408    .1446078    .4219649          0          2
        pe6s |      1224    1.465686    .8359066          0          2
        pe7s |      1224    1.405229    .8753023          0          2
        pe8s |       408    1.637255     .725651          0          2
-------------+--------------------------------------------------------
        pe9s |      1224    .1151961    .4436868          0          2
       pe9as |       918    .0196078     .138724          0          1
       pe10s |      1224    .2900327    .6186251          0          2
       pe11s |       918    .3169935    .5312019          0          2
       pe12s |      1224    .1895425    .3920991          0          1
-------------+--------------------------------------------------------
       pe13s |      1224    .5318627    .8320823          0          2
       pe14s |      1224    .1013072    .3997525          0          2
       pe15s |      1224    .1503268    .4972038          0          2
       pe16s |      1224    .4370915    .5156235          0          2
       pe17s |       459    .0588235    .3078726          0          2
-------------+--------------------------------------------------------
        pa1s |      1224    .6952614    .9515373          0          2
        pa2s |      1224     .376634     .693016          0          2
        pa3s |       918     .251634    .6079019          0          2
       pa3bs |        84    .9642857    .1866915          0          1
       pa3cs |        36    .8333333    .3779645          0          1
-------------+--------------------------------------------------------
        pa4s |      1224    .1527778     .410841          0          2
        pa5s |      1224    .1960784    .4809887          0          2
        pa6s |      1224    .0334967    .1800033          0          1
        pa7s |      1224    .0784314    .3689398          0          2
        pa8s |       408    .3039216    .6197283          0          2
-------------+--------------------------------------------------------
        pa9s |       306    .0457516    .2092882          0          1
       pa10s |       459    .1568627    .4145442          0          2
       pa11s |       459    .7647059    .4246453          0          1
        st1s |      1224    .0343137    .1821082          0          1
        st2s |      1224    .0563725    .2875309          0          2
-------------+--------------------------------------------------------
        st3s |      1224    .0931373    .3914273          0          2
        cp1s |      1224    .1838235    .5316167          0          2
        cp2s |      1224    .2638889    .5927912          0          2
        cp3s |      1224    .2843137     .670033          0          2
        cp4s |       459    .0980392    .3576617          0          2
-------------+--------------------------------------------------------
        cp5s |       459    .0784314    .3342739          0          2
        mp1s |      1224    .3954248    .7404968          0          2
        mp2s |      1224    .0596405    .2630817          0          2
        mp3s |      1224    .1143791    .4592886          0          2
         e1s |      1224    .3129085    .7045907          0          2
-------------+--------------------------------------------------------
         e2s |      1224     .250817    .6432232          0          2
         e3s |      1224    .5955882    .8409084          0          2
     e4s_new |      1224    .5245098    .8104311          0          4
         e5s |      1224    .1748366    .4772716          0          2
         e6s |      1224    .1911765    .5882918          0          2
-------------+--------------------------------------------------------
         e7s |      1224    .0514706    .2968317          0          2
         e8s |      1224    .1568627    .5193574          0          2
        e12s |      1224    .6821895    .9183207          0          2
        e13s |      1224    .4125817    .7612048          0          2
        e14s |      1224    .4321895    .7853793          0          2
-------------+--------------------------------------------------------
        e15s |      1224    .1544118    .4934702          0          2
        e16s |      1224    .0637255    .3514128          0          2
        e17s |      1224    .4191176    .8047247          0          2
         r1s |       612     .127451     .468411          0          2
         r2s |       612    .0931373    .4039315          0          2
-------------+--------------------------------------------------------
         r3s |       612    .1764706    .5501691          0          2
        r3ss |       612    .1078431    .4520952          0          2
         r4s |       612    .4509804    .7943431          0          2
         r5s |       612    .2565359    .6607092          0          2
         r6s |       612    .5898693    .8677314          0          2
-------------+--------------------------------------------------------
         r7s |       612           0           0          0          0
         r8s |       612    .0490196    .3095041          0          2
         r9s |       612    .2156863    .5966757          0          2
        r10s |       612    .1029412    .4252942          0          2
        r11s |       612    .0686275    .3643653          0          2
-------------+--------------------------------------------------------
        r12s |       612    .1862745    .5732223          0          2
        r13s |       612    .2696078    .6274082          0          2
        r14s |       612    .1568627    .5195698          0          2
        r15s |       612    .2728758    .6640521          0          2
        r16s |       612    .1323529    .4722745          0          2
-------------+--------------------------------------------------------
   northeast |      1224    .1764706    .3813759          0          1
     midwest |      1224    .2352941    .4243559          0          1
       south |      1224    .3333333    .4715972          0          1
        west |      1224     .254902    .4359842          0          1
      region |      1224    2.431373    1.053063          1          4
-------------+--------------------------------------------------------
  newengland |      1224    .1176471    .3223214          0          1
 midatlantic |      1224    .0588235    .2353903          0          1
  eastnorcen |      1224    .0980392    .2974892          0          1
   wesnorcen |      1224    .1372549    .3442569          0          1
    southatl |      1224    .1764706    .3813759          0          1
-------------+--------------------------------------------------------
   eastsocen |      1224    .0784314    .2689591          0          1
   westsocen |      1224    .0784314    .2689591          0          1
    mountain |      1224    .1568627      .36382          0          1
     pacific |      1224    .0980392    .2974892          0          1
    division |      1224    5.117647    2.510983          1          9




file C:/Users/Samuele/Google Drive/research projects/obesity/derived/bridging_the_gap/state/btg_state.dta saved

. 
end of do-file


Execute:  C:\Stata12_WinX86_x64\StataSE-64.exe /e do "./preclean_school_district.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   12.0   Copyright 1985-2011 StataCorp LP
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     Special Edition                  College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user Stata network perpetual license:
       Serial number:  93611859953
         Licensed to:  STATAforAll
                       STATA

Notes:
      1.  (/v# option or -set maxvar-) 5000 maximum variables
      2.  Stata running in batch mode

. do ./preclean_school_district.do 

. set more off

. adopath + ../../../lib/stata/gslab_misc/ado
  [1]  (UPDATES)   "C:\Stata12_WinX86_x64\ado\updates/"
  [2]  (BASE)      "C:\Stata12_WinX86_x64\ado\base/"
  [3]  (SITE)      "C:\Stata12_WinX86_x64\ado\site/"
  [4]              "."
  [5]  (PERSONAL)  "c:\ado\personal/"
  [6]  (PLUS)      "c:\ado\plus/"
  [7]  (OLDPLACE)  "c:\ado/"
  [8]              "../../../lib/stata/gslab_misc/ado"

. adopath + ../../../lib/third_party/stata_tools
  [1]  (UPDATES)   "C:\Stata12_WinX86_x64\ado\updates/"
  [2]  (BASE)      "C:\Stata12_WinX86_x64\ado\base/"
  [3]  (SITE)      "C:\Stata12_WinX86_x64\ado\site/"
  [4]              "."
  [5]  (PERSONAL)  "c:\ado\personal/"
  [6]  (PLUS)      "c:\ado\plus/"
  [7]  (OLDPLACE)  "c:\ado/"
  [8]              "../../../lib/stata/gslab_misc/ado"
  [9]              "../../../lib/third_party/stata_tools"

. preliminaries, loadglob("../../../lib/python/obesity/input
> _params.txt")

. 
. local raw_data_dir = "${GoogleDrive}/raw_data/bridging_the_gap/school_district/data"

. local derived_dir  = "${GoogleDrive}/derived/bridging_the_gap/school_district"

. 
. /*
>                      Stata Setup (Do File) for ICPSR 36528
>   
>        Bridging the Gap/National Wellness Policy Study District Wellness
>          Policy-Related Dataset, School Years 2006-2007 through 2013-2014
> 
> */
. 
. infile using "`raw_data_dir'/36528-0001-Setup.dct", using("`raw_data_dir'/36528-0001-Data.txt") clear

infile dictionary {

**********************************************************************
*                                                                         
*                   Stata Dictionary for ICPSR 36528
*
*    Bridging the Gap/National Wellness Policy Study District Wellness
*      Policy-Related Dataset, School Years 2006-2007 through 2013-2014
*
**********************************************************************

    _column(1)       long                                 id   %9f  "id Randomly assigned district identifier"
   _column(10)       str2                         gradelevel   %2s  "Grade level saved as ES MS HS"
   _column(12)       byte                  gradelevelnumeric   %1f  "Grade level saved as numeric"
   _column(13)       byte                               year   %1f  "year year of data collection"
   _column(14)       byte                                yr1   %1f  "In Yr 1 (SY 06-07) data collection"
   _column(15)       byte                                yr2   %1f  "In Yr 2 (SY 07-08) data collection"
   _column(16)       byte                                yr3   %1f  "In Yr 3 (SY 08-09) data collection"
   _column(17)       byte                                yr4   %1f  "In Yr 4 (SY 09-10) data collection"
   _column(18)       byte                                yr5   %1f  "In Yr 5 (SY 10-11) data collection"
   _column(19)       byte                                yr6   %1f  "In Yr 6 (SY 11-12) data collection"
   _column(20)       byte                                yr7   %1f  "In Yr 7 (SY 12-13) data collection"
   _column(21)       byte                                yr8   %1f  "In Yr 8 (SY 13-14) data collection"
   _column(22)       byte                                 es   %1f  "Policy applicable to Elementary School grades"
   _column(23)       byte                                 ms   %1f  "Policy applicable to Middle School grades"
   _column(24)       byte                                 hs   %1f  "Policy applicable to High School grades"
   _column(25)       byte                             dist_3   %1f  "dist_3 District has 3rd grade school (1=yes, 0=no)"
   _column(26)       byte                             dist_8   %1f  "dist_8 District has 8th grade school (1=yes, 0=no)"
   _column(27)       byte                            dist_10   %1f  "dist_10 District has 10th grade school (1=yes, 0=no)"
   _column(28)       byte                            dist_12   %1f  "dist_12 District has 12th grade school (1=yes, 0=no)"
   _column(29)     double                        distnrwgt_d  %17f  "distnrwgt_d District weight with non-response adjustment"
   _column(46)        int                            stratum   %3f  "stratum Stratum"
   _column(49)       long                           psu_deid   %9f  "psu_deid Primary sampling unit--de-identified"
   _column(58)     double                              d_fpc  %19f  "d_fpc Finite population correction factor"
   _column(77)       byte                               ne1r   %2f  "ne1r District: FW: Goals for NE"
   _column(79)       byte                               ne2r   %2f  "ne2r District: Nutrition curriculum for each grade"
   _column(81)       byte                               ne3r   %2f  "ne3r District: School gardens"
   _column(83)       byte                               ne4r   %2f  "ne4r District: NE training for teachers"
   _column(85)       byte                               ne5r   %2f  "ne5r District: NE integrated into other subjects"
   _column(87)       byte                               ne6r   %2f  "ne6r District: NE teaches behavior-focused skills"
   _column(89)       byte                               ne7r   %2f  "ne7r District: Number NE courses or hours specified"
   _column(91)       byte                               us1r   %2f  "us1r District: FW: School meal guidelines not less restrictive than federal guid"
   _column(93)       byte                               us2r   %2f  "us2r District: School breakfast program"
   _column(95)       byte                               us3r   %2f  "us3r District: Guidelines beyond dietary guidelines"
   _column(97)       byte                               us4r   %2f  "us4r District: Low-fat cooking-methods"
   _column(99)       byte                               us5r   %2f  "us5r District: Strategies to increase participation"
  _column(101)       byte                              us5ar   %2f  "us5ar District: Closed campus provisions"
  _column(103)       byte                               us6r   %2f  "us6r District: Recess before lunch"
  _column(105)       byte                               us7r   %2f  "us7r District: Adequate time to eat"
  _column(107)       byte                               us8r   %2f  "us8r District: Training for food service staff"
  _column(109)       byte                               us9r   %2f  "us9r District: Nutrition information for school meals"
  _column(111)       byte                              us10r   %2f  "us10r District: Farm-to-school-cafeteria provisions"
  _column(113)       byte                              us11r   %2f  "us11r District: Fat content of milk-meals"
  _column(115)       byte                              us12r   %2f  "us12r District: Half of grains are whole grains-meals"
  _column(117)       byte                              us13r   %2f  "us13r District: Specifies number of fruits & veg-meals"
  _column(119)       byte                              us14r   %2f  "us14r District: Free drinking water during meals"
  _column(121)       byte                              us15r   %2f  "us15r District: Flavor of milk"
  _column(123)       byte                               ng1r   %2f  "ng1r District: FW: NG for all foods at school (competitive foods)"
  _column(125)       byte                               ng2r   %2f  "ng2r District: Competitive food ban-cannot be sold"
  _column(127)       byte                             ng2rsd   %2f  "ng2rsd District: Competitive food ban-cannot be sold-school day"
  _column(129)       byte                               ng3r   %2f  "ng3r District: Contract compliance with NG"
  _column(131)       byte                             ng3rsd   %2f  "ng3rsd District: Contract compliance with ng-school day"
  _column(133)       byte                               ng4r   %2f  "ng4r District: Fast food restrictions"
  _column(135)       byte                             ng4rsd   %2f  "ng4rsd District: Fast food restrictions-school day"
  _column(137)       byte                               ng5r   %2f  "ng5r District: Meets IOM F&V and-or whole grain std"
  _column(139)       byte                             ng5rsd   %2f  "ng5rsd District: Meets IOM F&V and-or whole grain std-school day"
  _column(141)       byte                               ng6r   %2f  "ng6r District: Whole, unprocessed & fresh food availability"
  _column(143)       byte                               ng7r   %2f  "ng7r District: Food as reward or punishment"
  _column(145)       byte                               ng8r   %2f  "ng8r District: Nutrition info for competitive foods"
  _column(147)       byte                               ng9r   %2f  "ng9r District: Free drinking water"
  _column(149)       byte                              ng10r   %2f  "ng10r District: Vending machines"
  _column(151)       byte                            ng10rsd   %2f  "ng10rsd District: Vending machines-school day"
  _column(153)       byte                            ng16rvm   %2f  "ng16rvm District Vending: Sugar content of foods"
  _column(155)       byte                          ng16rvmsd   %2f  "ng16rvmsd District Vending: Sugar content of foods-school day"
  _column(157)       byte                            ng17rvm   %2f  "ng17rvm District Vending: Candy limits"
  _column(159)       byte                          ng17rvmsd   %2f  "ng17rvmsd District Vending: Candy limits-school day"
  _column(161)       byte                            ng18rvm   %2f  "ng18rvm District Vending: Fat content of foods"
  _column(163)       byte                          ng18rvmsd   %2f  "ng18rvmsd District Vending: Fat content of foods-school day"
  _column(165)       byte                            ng19rvm   %2f  "ng19rvm District Vending: Trans fat limits"
  _column(167)       byte                          ng19rvmsd   %2f  "ng19rvmsd District Vending: Trans fat limits-school day"
  _column(169)       byte                            ng20rvm   %2f  "ng20rvm District Vending: Sodium content of foods"
  _column(171)       byte                          ng20rvmsd   %2f  "ng20rvmsd District Vending: Sodium content of foods-school day"
  _column(173)       byte                            ng21rvm   %2f  "ng21rvm District Vending: Calorie content-serving size"
  _column(175)       byte                          ng21rvmsd   %2f  "ng21rvmsd District Vending: Calorie content-serving size-school day"
  _column(177)       byte                            ng22rvm   %2f  "ng22rvm District Vending: Sugar content of beverages"
  _column(179)       byte                          ng22rvmsd   %2f  "ng22rvmsd District Vending: Sugar content of beverages-school day"
  _column(181)       byte                            ng23rvm   %2f  "ng23rvm District Vending: Calorie content of beverages"
  _column(183)       byte                          ng23rvmsd   %2f  "ng23rvmsd District Vending: Calorie content of beverages-school day"
  _column(185)       byte                            ng24rvm   %2f  "ng24rvm District Vending: Regular, sugar-sweetened soda"
  _column(187)       byte                          ng24rvmsd   %2f  "ng24rvmsd District Vending: Regular, sugar-sweetened soda-school day"
  _column(189)       byte                            ng25rvm   %2f  "ng25rvm District Vending: Beverages other than regular soda"
  _column(191)       byte                          ng25rvmsd   %2f  "ng25rvmsd District Vending: Beverages other than regular soda-school day"
  _column(193)       byte                            ng26rvm   %2f  "ng26rvm District Vending: Sugar-calorie content of milk"
  _column(195)       byte                          ng26rvmsd   %2f  "ng26rvmsd District Vending: Sugar-calorie content of milk-school day"
  _column(197)       byte                            ng27rvm   %2f  "ng27rvm District Vending: Fat content of milk"
  _column(199)       byte                          ng27rvmsd   %2f  "ng27rvmsd District Vending: Fat content of milk-school day"
  _column(201)       byte                            ng28rvm   %2f  "ng28rvm District Vending: Serving size limit for beverages"
  _column(203)       byte                          ng28rvmsd   %2f  "ng28rvmsd District Vending: Serving size limit for beverages-school day"
  _column(205)       byte                            ng29rvm   %2f  "ng29rvm District Vending: Caffeine content of beverages"
  _column(207)       byte                            ng30rvm   %2f  "ng30rvm District Vending: Water available through District Vending machines"
  _column(209)       byte                          ng30rvmsd   %2f  "ng30rvmsd District Vending: Water available through District Vending machines-sc"
  _column(211)       byte                          ng29rvmsd   %2f  "ng29rvmsd District Vending: Caffeine content of beverages-school day"
  _column(213)       byte                              ng11r   %2f  "ng11r District: School stores"
  _column(215)       byte                            ng11rsd   %2f  "ng11rsd District: School stores-school day"
  _column(217)       byte                            ng16rss   %2f  "ng16rss District Stores: Sugar content of foods"
  _column(219)       byte                          ng16rsssd   %2f  "ng16rsssd District Stores: Sugar content of foods-school day"
  _column(221)       byte                            ng17rss   %2f  "ng17rss District Stores: Candy limits"
  _column(223)       byte                          ng17rsssd   %2f  "ng17rsssd District Stores: Candy limits-school day"
  _column(225)       byte                            ng18rss   %2f  "ng18rss District Stores: Fat content of foods"
  _column(227)       byte                          ng18rsssd   %2f  "ng18rsssd District Stores: Fat content of foods-school day"
  _column(229)       byte                            ng19rss   %2f  "ng19rss District Stores: Trans fat limits"
  _column(231)       byte                          ng19rsssd   %2f  "ng19rsssd District Stores: Trans fat limits-school day"
  _column(233)       byte                            ng20rss   %2f  "ng20rss District Stores: Sodium content of foods"
  _column(235)       byte                          ng20rsssd   %2f  "ng20rsssd District Stores: Sodium content of foods-school day"
  _column(237)       byte                            ng21rss   %2f  "ng21rss District Stores: Calorie content-serving size"
  _column(239)       byte                          ng21rsssd   %2f  "ng21rsssd District Stores: Calorie content-serving size-school day"
  _column(241)       byte                            ng22rss   %2f  "ng22rss District Stores: Sugar content of beverages"
  _column(243)       byte                          ng22rsssd   %2f  "ng22rsssd District Stores: Sugar content of beverages-school day"
  _column(245)       byte                            ng23rss   %2f  "ng23rss District Stores: Calorie content of beverages"
  _column(247)       byte                          ng23rsssd   %2f  "ng23rsssd District Stores: Calorie content of beverages-school day"
  _column(249)       byte                            ng24rss   %2f  "ng24rss District Stores: Regular, sugar-sweetened soda"
  _column(251)       byte                          ng24rsssd   %2f  "ng24rsssd District Stores: Regular, sugar-sweetened soda-school day"
  _column(253)       byte                            ng25rss   %2f  "ng25rss District Stores: Beverages other than regular soda"
  _column(255)       byte                          ng25rsssd   %2f  "ng25rsssd District Stores: Beverages other than regular soda-school day"
  _column(257)       byte                            ng26rss   %2f  "ng26rss District Stores: Sugar-calorie content of milk"
  _column(259)       byte                          ng26rsssd   %2f  "ng26rsssd District Stores: Sugar-calorie content of milk-school day"
  _column(261)       byte                            ng27rss   %2f  "ng27rss District Stores: Fat content of milk"
  _column(263)       byte                          ng27rsssd   %2f  "ng27rsssd District Stores: Fat content of milk-school day"
  _column(265)       byte                            ng28rss   %2f  "ng28rss District Stores: Serving size limit for beverages"
  _column(267)       byte                          ng28rsssd   %2f  "ng28rsssd District Stores: Serving size limit for beverages-school day"
  _column(269)       byte                            ng29rss   %2f  "ng29rss District Stores: Caffeine content of beverages"
  _column(271)       byte                          ng29rsssd   %2f  "ng29rsssd District Stores: Caffeine content of beverages-school day"
  _column(273)       byte                            ng30rss   %2f  "ng30rss District Stores: Water available through school District Stores"
  _column(275)       byte                          ng30rsssd   %2f  "ng30rsssd District Stores: Water available through school District Stores-school"
  _column(277)       byte                              ng12r   %2f  "ng12r District: A la carte"
  _column(279)       byte                            ng16ral   %2f  "ng16ral District A la carte: Sugar content of foods"
  _column(281)       byte                            ng17ral   %2f  "ng17ral District A la carte: Candy limits"
  _column(283)       byte                            ng18ral   %2f  "ng18ral District A la carte: Fat content of foods"
  _column(285)       byte                            ng19ral   %2f  "ng19ral District A la carte: Trans fat limits"
  _column(287)       byte                            ng20ral   %2f  "ng20ral District A la carte: Sodium content of foods"
  _column(289)       byte                            ng21ral   %2f  "ng21ral District A la carte: Calorie content-serving size"
  _column(291)       byte                            ng22ral   %2f  "ng22ral District A la carte: Sugar content of beverages"
  _column(293)       byte                            ng23ral   %2f  "ng23ral District A la carte: Calorie content of beverages"
  _column(295)       byte                            ng24ral   %2f  "ng24ral District A la carte: Regular, sugar-sweetened soda"
  _column(297)       byte                            ng25ral   %2f  "ng25ral District A la carte: Beverages other than regular soda"
  _column(299)       byte                            ng26ral   %2f  "ng26ral District A la carte: Sugar-calorie content of milk"
  _column(301)       byte                            ng27ral   %2f  "ng27ral District A la carte: Fat content of milk"
  _column(303)       byte                            ng28ral   %2f  "ng28ral District A la carte: Serving size limit for beverages"
  _column(305)       byte                            ng29ral   %2f  "ng29ral District A la carte: Caffeine content of beverages"
  _column(307)       byte                            ng30ral   %2f  "ng30ral District A la carte: Water available through District A la carte"
  _column(309)       byte                              ng13r   %2f  "ng13r District: Parties"
  _column(311)       byte                            ng16rcp   %2f  "ng16rcp District Parties: Sugar content of foods"
  _column(313)       byte                            ng17rcp   %2f  "ng17rcp District Parties: Candy limits"
  _column(315)       byte                            ng18rcp   %2f  "ng18rcp District Parties: Fat content of foods"
  _column(317)       byte                            ng19rcp   %2f  "ng19rcp District Parties: Trans fat limits"
  _column(319)       byte                            ng20rcp   %2f  "ng20rcp District Parties: Sodium content of foods"
  _column(321)       byte                            ng21rcp   %2f  "ng21rcp District Parties: Calorie content-serving size"
  _column(323)       byte                            ng22rcp   %2f  "ng22rcp District Parties: Sugar content of beverages"
  _column(325)       byte                            ng23rcp   %2f  "ng23rcp District Parties: Calorie content of beverages"
  _column(327)       byte                            ng24rcp   %2f  "ng24rcp District Parties: Regular, sugar-sweetened soda"
  _column(329)       byte                            ng25rcp   %2f  "ng25rcp District Parties: Beverages other than regular soda"
  _column(331)       byte                            ng26rcp   %2f  "ng26rcp District Parties: Sugar-calorie content of milk"
  _column(333)       byte                            ng27rcp   %2f  "ng27rcp District Parties: Fat content of milk"
  _column(335)       byte                            ng28rcp   %2f  "ng28rcp District Parties: Serving size limit for beverages"
  _column(337)       byte                            ng29rcp   %2f  "ng29rcp District Parties: Caffeine content of beverages"
  _column(339)       byte                              ng14r   %2f  "ng14r District: Events"
  _column(341)       byte                            ng16rev   %2f  "ng16rev District Events: Sugar content of foods"
  _column(343)       byte                            ng17rev   %2f  "ng17rev District Events: Candy limits"
  _column(345)       byte                            ng18rev   %2f  "ng18rev District Events: Fat content of foods"
  _column(347)       byte                            ng19rev   %2f  "ng19rev District Events: Trans fat limits"
  _column(349)       byte                            ng20rev   %2f  "ng20rev District Events: Sodium content of foods"
  _column(351)       byte                            ng21rev   %2f  "ng21rev District Events: Calorie content-serving size"
  _column(353)       byte                            ng22rev   %2f  "ng22rev District Events: Sugar content of beverages"
  _column(355)       byte                            ng23rev   %2f  "ng23rev District Events: Calorie content of beverages"
  _column(357)       byte                            ng24rev   %2f  "ng24rev District Events: Regular, sugar-sweetened soda"
  _column(359)       byte                            ng25rev   %2f  "ng25rev District Events: Beverages other than regular soda"
  _column(361)       byte                            ng26rev   %2f  "ng26rev District Events: Sugar-calorie content of milk"
  _column(363)       byte                            ng27rev   %2f  "ng27rev District Events: Fat content of milk"
  _column(365)       byte                            ng28rev   %2f  "ng28rev District Events: Serving size limit for beverages"
  _column(367)       byte                            ng29rev   %2f  "ng29rev District Events: Caffeine content of beverages"
  _column(369)       byte                              ng15r   %2f  "ng15r District: Fundraisers"
  _column(371)       byte                            ng15rsd   %2f  "ng15rsd District: Fundraisers-school day"
  _column(373)       byte                            ng16rfr   %2f  "ng16rfr District Fundraisers: Sugar content of foods"
  _column(375)       byte                          ng16rfrsd   %2f  "ng16rfrsd District Fundraisers: Sugar content of foods-school day"
  _column(377)       byte                            ng17rfr   %2f  "ng17rfr District Fundraisers: Candy limits"
  _column(379)       byte                          ng17rfrsd   %2f  "ng17rfrsd District Fundraisers: Candy limits-school day"
  _column(381)       byte                            ng18rfr   %2f  "ng18rfr District Fundraisers: Fat content of foods"
  _column(383)       byte                          ng18rfrsd   %2f  "ng18rfrsd District Fundraisers: Fat content of foods-school day"
  _column(385)       byte                            ng19rfr   %2f  "ng19rfr District Fundraisers: Trans fat limits"
  _column(387)       byte                          ng19rfrsd   %2f  "ng19rfrsd District Fundraisers: Trans fat limits-school day"
  _column(389)       byte                            ng20rfr   %2f  "ng20rfr District Fundraisers: Sodium content of foods"
  _column(391)       byte                          ng20rfrsd   %2f  "ng20rfrsd District Fundraisers: Sodium content of foods-school day"
  _column(393)       byte                            ng21rfr   %2f  "ng21rfr District Fundraisers: Calorie content-serving size"
  _column(395)       byte                          ng21rfrsd   %2f  "ng21rfrsd District Fundraisers: Calorie content-serving size-school day"
  _column(397)       byte                            ng22rfr   %2f  "ng22rfr District Fundraisers: Sugar content of beverages"
  _column(399)       byte                          ng22rfrsd   %2f  "ng22rfrsd District Fundraisers: Sugar content of beverages-school day"
  _column(401)       byte                            ng23rfr   %2f  "ng23rfr District Fundraisers: Calorie content of beverages"
  _column(403)       byte                          ng23rfrsd   %2f  "ng23rfrsd District Fundraisers: Calorie content of beverages-school day"
  _column(405)       byte                            ng24rfr   %2f  "ng24rfr District Fundraisers: Regular, sugar-sweetened soda"
  _column(407)       byte                          ng24rfrsd   %2f  "ng24rfrsd District Fundraisers: Regular, sugar-sweetened soda-school day"
  _column(409)       byte                            ng25rfr   %2f  "ng25rfr District Fundraisers: Beverages other than regular soda"
  _column(411)       byte                          ng25rfrsd   %2f  "ng25rfrsd District Fundraisers: Beverages other than regular soda-school day"
  _column(413)       byte                            ng26rfr   %2f  "ng26rfr District Fundraisers: Sugar-calorie content of milk"
  _column(415)       byte                          ng26rfrsd   %2f  "ng26rfrsd District Fundraisers: Sugar-calorie content of milk-school day"
  _column(417)       byte                            ng27rfr   %2f  "ng27rfr District Fundraisers: Fat content of milk"
  _column(419)       byte                          ng27rfrsd   %2f  "ng27rfrsd District Fundraisers: Fat content of milk-school day"
  _column(421)       byte                            ng28rfr   %2f  "ng28rfr District Fundraisers: Serving size limit for beverages"
  _column(423)       byte                          ng28rfrsd   %2f  "ng28rfrsd District Fundraisers: Serving size limit for beverages-school day"
  _column(425)       byte                            ng29rfr   %2f  "ng29rfr District Fundraisers: Caffeine content of beverages"
  _column(427)       byte                          ng29rfrsd   %2f  "ng29rfrsd District Fundraisers: Caffeine content of beverages-school day"
  _column(429)       byte                               pe1r   %2f  "pe1r District: PE mentioned"
  _column(431)       byte                               pe2r   %2f  "pe2r District: PE curriculum for each grade"
  _column(433)       byte                               pe3r   %2f  "pe3r District: Time-week of PE for ES"
  _column(435)       byte                               pe4r   %2f  "pe4r District: Time-week of PE for MS"
  _column(437)       byte                               pe5r   %2f  "pe5r District: Time-week of PE for HS"
  _column(439)       byte                               pe6r   %2f  "pe6r District: PE teaches physically active lifestyle"
  _column(441)       byte                               pe7r   %2f  "pe7r District: PE competency assessment"
  _column(443)       byte                               pe8r   %2f  "pe8r District: Addresses PE classes-credits-course-hours"
  _column(445)       byte                               pe9r   %2f  "pe9r District: Frequency of required PE"
  _column(447)       byte                              pe10r   %2f  "pe10r District: Teacher-student ratio for PE"
  _column(449)       byte                              pe11r   %2f  "pe11r District: Safe-adequate equipment-facilities for PE"
  _column(451)       byte                              pe12r   %2f  "pe12r District: Moderate to vigorous PA during PE class time"
  _column(453)       byte                              pe13r   %2f  "pe13r District: Qualifications of PE instructors"
  _column(455)       byte                              pe14r   %2f  "pe14r District: PE training for teachers"
  _column(457)       byte                              pe15r   %2f  "pe15r District: PE waiver requirements"
  _column(459)       byte                              pe16r   %2f  "pe16r District: Annual health assessment"
  _column(461)       byte                              pe17r   %2f  "pe17r District: Free drinking water in the gymnasium"
  _column(463)       byte                               pa1r   %2f  "pa1r District: FW: Goals for PA"
  _column(465)       byte                               pa2r   %2f  "pa2r District: PA for every grade level"
  _column(467)       byte                               pa3r   %2f  "pa3r District: Amount of time for PA"
  _column(469)       byte                              pa3br   %2f  "pa3br District: Definition of PA includes PE"
  _column(471)       byte                              pa3cr   %2f  "pa3cr District: Definition of PA includes recess"
  _column(473)       byte                               pa4r   %2f  "pa4r District: PA throughout the day"
  _column(475)       byte                               pa5r   %2f  "pa5r District: Community use facilities for PA"
  _column(477)       byte                               pa6r   %2f  "pa6r District: Safe active routes to school"
  _column(479)       byte                               pa7r   %2f  "pa7r District: Not using PA as punishment"
  _column(481)       byte                               pa8r   %2f  "pa8r District: Recess freq or amount for ES (daily)"
  _column(483)       byte                               pa9r   %2f  "pa9r District: Recess freq (less than daily) for ES"
  _column(485)       byte                              pa10r   %2f  "pa10r District: PA before/after school (excluding intra/extramural"
  _column(487)       byte                               st1r   %2f  "st1r District: PA for school staff"
  _column(489)       byte                               st2r   %2f  "st2r District: Staff wellness programs"
  _column(491)       byte                               st3r   %2f  "st3r District: Staff to role model"
  _column(493)       byte                               cp1r   %2f  "cp1r District: FW: Stakeholders involved in development of wellness policy"
  _column(495)       byte                               cp2r   %2f  "cp2r District: Methods to solicit input"
  _column(497)       byte                               cp3r   %2f  "cp3r District: How to engage parents-community"
  _column(499)       byte                               cp4r   %2f  "cp4r District: Stakeholders involved in periodic review of WP (Y6)"
  _column(501)       byte                               cp5r   %2f  "cp5r District: Stakeholders involved in update of WP (Y6)"
  _column(503)       byte                               mp1r   %2f  "mp1r District: Coordinated school health model"
  _column(505)       byte                               mp2r   %2f  "mp2r District: Marketing-promotion of healthy choices"
  _column(507)       byte                               mp3r   %2f  "mp3r District: Restricted marketing"
  _column(509)       byte                                e1r   %2f  "e1r District: FW: Measuring implementation"
  _column(511)       byte                                e2r   %2f  "e2r District: Plan for implementation"
  _column(513)       byte                                e3r   %2f  "e3r District: Ongoing health advisory committee"
  _column(515)       byte                            e4r_new   %2f  "e4r_new District: New BMI measurement"
  _column(517)       byte                                e5r   %2f  "e5r District: Plan for evaluation"
  _column(519)       byte                                e6r   %2f  "e6r District: Audience and frequency of reporting"
  _column(521)       byte                                e7r   %2f  "e7r District: Funding support"
  _column(523)       byte                                e8r   %2f  "e8r District: Plan for revising the policy"
  _column(525)       byte                               e12r   %2f  "e12r District: Requires District to report to State"
  _column(527)       byte                                r1r   %2f  "r1r District: Public posting-access to WP on web"
  _column(529)       byte                                r2r   %2f  "r2r District: Public posting-access to WP on non-web"
  _column(531)       byte                                r3r   %2f  "r3r District: District reporting of WP to State"
  _column(533)       byte                                r4r   %2f  "r4r District: Reporting to public"
  _column(535)       byte                                r5r   %2f  "r5r District: Reporting to District"
  _column(537)       byte                                r6r   %2f  "r6r District: Reporting to State"
  _column(539)       byte                                r7r   %2f  "r7r District: Reporting to other-or non-specific reporting requirement"
  _column(541)       byte                                r8r   %2f  "r8r District: Reporting on food safety inspections"
  _column(543)       byte                                r9r   %2f  "r9r District: Reporting on local wp compliance"
  _column(545)       byte                               r10r   %2f  "r10r District: Reporting on meal program participation"
  _column(547)       byte                               r11r   %2f  "r11r District: Reporting nutritional quality of program meals"
  _column(549)       byte                               r12r   %2f  "r12r District: Reporting on competitive f&b available-sold"
  _column(551)       byte                               r13r   %2f  "r13r District: Reporting on PE-PA requirements"
  _column(553)       byte                               r14r   %2f  "r14r District: Reporting on fitness assessments"
  _column(555)       byte                               r15r   %2f  "r15r District: Reporting on BMI"
  _column(557)       byte                               r16r   %2f  "r16r District: Reporting on other-School Health Index"
  _column(559)       byte                             region   %1f  "region NCES recode: US regions"
  _column(560)       byte                        locale_4grp   %1f  "locale_4grp NCES recode: Locale-4 group"
  _column(561)       byte           free_redlch_elig_pr_gt66   %1f  "Flag: >66% of students eligible for free/reduced-price lunch"
}

(15327 observations read)

. 
. #delimit ;
delimiter now ;
.  recode ne1r-r16r (-6 = .c) (-7 = .g) (-8 = .m) (-9 = .n);
(ne1r: 1050 changes made)
(ne2r: 1050 changes made)
(ne3r: 4302 changes made)
(ne4r: 1050 changes made)
(ne5r: 1050 changes made)
(ne6r: 1050 changes made)
(ne7r: 1050 changes made)
(us1r: 1050 changes made)
(us2r: 1050 changes made)
(us3r: 1050 changes made)
(us4r: 1050 changes made)
(us5r: 1050 changes made)
(us5ar: 4302 changes made)
(us6r: 11513 changes made)
(us7r: 1049 changes made)
(us8r: 1049 changes made)
(us9r: 1049 changes made)
(us10r: 1049 changes made)
(us11r: 5905 changes made)
(us12r: 5905 changes made)
(us13r: 5905 changes made)
(us14r: 9467 changes made)
(us15r: 11321 changes made)
(ng1r: 1049 changes made)
(ng2r: 1049 changes made)
(ng2rsd: 1049 changes made)
(ng3r: 1049 changes made)
(ng3rsd: 1049 changes made)
(ng4r: 4301 changes made)
(ng4rsd: 4301 changes made)
(ng5r: 4301 changes made)
(ng5rsd: 4301 changes made)
(ng6r: 1049 changes made)
(ng7r: 1049 changes made)
(ng8r: 1049 changes made)
(ng9r: 1049 changes made)
(ng10r: 1049 changes made)
(ng10rsd: 1049 changes made)
(ng16rvm: 4301 changes made)
(ng16rvmsd: 4301 changes made)
(ng17rvm: 4301 changes made)
(ng17rvmsd: 4301 changes made)
(ng18rvm: 4301 changes made)
(ng18rvmsd: 4301 changes made)
(ng19rvm: 4301 changes made)
(ng19rvmsd: 4301 changes made)
(ng20rvm: 4301 changes made)
(ng20rvmsd: 4301 changes made)
(ng21rvm: 4301 changes made)
(ng21rvmsd: 4301 changes made)
(ng22rvm: 4301 changes made)
(ng22rvmsd: 4301 changes made)
(ng23rvm: 4301 changes made)
(ng23rvmsd: 4301 changes made)
(ng24rvm: 4301 changes made)
(ng24rvmsd: 4301 changes made)
(ng25rvm: 4301 changes made)
(ng25rvmsd: 4301 changes made)
(ng26rvm: 4301 changes made)
(ng26rvmsd: 4301 changes made)
(ng27rvm: 4301 changes made)
(ng27rvmsd: 4301 changes made)
(ng28rvm: 4301 changes made)
(ng28rvmsd: 4301 changes made)
(ng29rvm: 4301 changes made)
(ng30rvm: 9467 changes made)
(ng30rvmsd: 9467 changes made)
(ng29rvmsd: 4301 changes made)
(ng11r: 1049 changes made)
(ng11rsd: 1049 changes made)
(ng16rss: 4301 changes made)
(ng16rsssd: 4301 changes made)
(ng17rss: 4301 changes made)
(ng17rsssd: 4301 changes made)
(ng18rss: 4301 changes made)
(ng18rsssd: 4301 changes made)
(ng19rss: 4301 changes made)
(ng19rsssd: 4301 changes made)
(ng20rss: 4301 changes made)
(ng20rsssd: 4301 changes made)
(ng21rss: 4301 changes made)
(ng21rsssd: 4301 changes made)
(ng22rss: 4301 changes made)
(ng22rsssd: 4301 changes made)
(ng23rss: 4301 changes made)
(ng23rsssd: 4301 changes made)
(ng24rss: 4301 changes made)
(ng24rsssd: 4301 changes made)
(ng25rss: 4301 changes made)
(ng25rsssd: 4301 changes made)
(ng26rss: 4301 changes made)
(ng26rsssd: 4301 changes made)
(ng27rss: 4301 changes made)
(ng27rsssd: 4301 changes made)
(ng28rss: 4301 changes made)
(ng28rsssd: 4304 changes made)
(ng29rss: 4301 changes made)
(ng29rsssd: 4301 changes made)
(ng30rss: 9467 changes made)
(ng30rsssd: 9467 changes made)
(ng12r: 1049 changes made)
(ng16ral: 4302 changes made)
(ng17ral: 4301 changes made)
(ng18ral: 4301 changes made)
(ng19ral: 4301 changes made)
(ng20ral: 4301 changes made)
(ng21ral: 4301 changes made)
(ng22ral: 4301 changes made)
(ng23ral: 4301 changes made)
(ng24ral: 4301 changes made)
(ng25ral: 4301 changes made)
(ng26ral: 4301 changes made)
(ng27ral: 4301 changes made)
(ng28ral: 4301 changes made)
(ng29ral: 4301 changes made)
(ng30ral: 9467 changes made)
(ng13r: 1048 changes made)
(ng16rcp: 4301 changes made)
(ng17rcp: 4301 changes made)
(ng18rcp: 4301 changes made)
(ng19rcp: 4301 changes made)
(ng20rcp: 4301 changes made)
(ng21rcp: 4301 changes made)
(ng22rcp: 4301 changes made)
(ng23rcp: 4301 changes made)
(ng24rcp: 4301 changes made)
(ng25rcp: 4301 changes made)
(ng26rcp: 4301 changes made)
(ng27rcp: 4301 changes made)
(ng28rcp: 4301 changes made)
(ng29rcp: 4301 changes made)
(ng14r: 6909 changes made)
(ng16rev: 10161 changes made)
(ng17rev: 10161 changes made)
(ng18rev: 10161 changes made)
(ng19rev: 10161 changes made)
(ng20rev: 10161 changes made)
(ng21rev: 10161 changes made)
(ng22rev: 10161 changes made)
(ng23rev: 10161 changes made)
(ng24rev: 10161 changes made)
(ng25rev: 10161 changes made)
(ng26rev: 10161 changes made)
(ng27rev: 10161 changes made)
(ng28rev: 10161 changes made)
(ng29rev: 10161 changes made)
(ng15r: 1049 changes made)
(ng15rsd: 1050 changes made)
(ng16rfr: 4302 changes made)
(ng16rfrsd: 4302 changes made)
(ng17rfr: 4302 changes made)
(ng17rfrsd: 4302 changes made)
(ng18rfr: 4302 changes made)
(ng18rfrsd: 4302 changes made)
(ng19rfr: 4302 changes made)
(ng19rfrsd: 4302 changes made)
(ng20rfr: 4302 changes made)
(ng20rfrsd: 4302 changes made)
(ng21rfr: 4302 changes made)
(ng21rfrsd: 4302 changes made)
(ng22rfr: 4302 changes made)
(ng22rfrsd: 4302 changes made)
(ng23rfr: 4302 changes made)
(ng23rfrsd: 4302 changes made)
(ng24rfr: 4302 changes made)
(ng24rfrsd: 4302 changes made)
(ng25rfr: 4302 changes made)
(ng25rfrsd: 4302 changes made)
(ng26rfr: 4302 changes made)
(ng26rfrsd: 4302 changes made)
(ng27rfr: 4302 changes made)
(ng27rfrsd: 4302 changes made)
(ng28rfr: 4302 changes made)
(ng28rfrsd: 4302 changes made)
(ng29rfr: 4302 changes made)
(ng29rfrsd: 4302 changes made)
(pe1r: 1049 changes made)
(pe2r: 1049 changes made)
(pe3r: 10394 changes made)
(pe4r: 10460 changes made)
(pe5r: 10849 changes made)
(pe6r: 1049 changes made)
(pe7r: 1049 changes made)
(pe8r: 10849 changes made)
(pe9r: 1049 changes made)
(pe10r: 1049 changes made)
(pe11r: 1049 changes made)
(pe12r: 1049 changes made)
(pe13r: 1049 changes made)
(pe14r: 1049 changes made)
(pe15r: 1049 changes made)
(pe16r: 1049 changes made)
(pe17r: 9467 changes made)
(pa1r: 1049 changes made)
(pa2r: 1049 changes made)
(pa3r: 4301 changes made)
(pa3br: 14696 changes made)
(pa3cr: 15027 changes made)
(pa4r: 1049 changes made)
(pa5r: 1049 changes made)
(pa6r: 1049 changes made)
(pa7r: 1049 changes made)
(pa8r: 10394 changes made)
(pa9r: 11513 changes made)
(pa10r: 9467 changes made)
(st1r: 1049 changes made)
(st2r: 1049 changes made)
(st3r: 1049 changes made)
(cp1r: 1049 changes made)
(cp2r: 1049 changes made)
(cp3r: 1049 changes made)
(cp4r: 9467 changes made)
(cp5r: 9467 changes made)
(mp1r: 1049 changes made)
(mp2r: 1045 changes made)
(mp3r: 1049 changes made)
(e1r: 1049 changes made)
(e2r: 1049 changes made)
(e3r: 1049 changes made)
(e4r_new: 1048 changes made)
(e5r: 1049 changes made)
(e6r: 1049 changes made)
(e7r: 1049 changes made)
(e8r: 1049 changes made)
(e12r: 1049 changes made)
(r1r: 7607 changes made)
(r2r: 7607 changes made)
(r3r: 7607 changes made)
(r4r: 7607 changes made)
(r5r: 7607 changes made)
(r6r: 7607 changes made)
(r7r: 7607 changes made)
(r8r: 7607 changes made)
(r9r: 7607 changes made)
(r10r: 7610 changes made)
(r11r: 7610 changes made)
(r12r: 7607 changes made)
(r13r: 7607 changes made)
(r14r: 7607 changes made)
(r15r: 7607 changes made)
(r16r: 7607 changes made)

.  label define gradelevelnumeric
>    1 "ES"
>    2 "MS"
>    3 "HS";

.  label define year
>    1 "Y1_0607"
>    2 "Y2_0708"
>    3 "Y3_0809"
>    4 "Y4_0910"
>    5 "Y5_1011"
>    6 "Y6_1112"
>    7 "Y7_1213"
>    8 "Y8_1314";

.  label define yr1
>    0 "No"
>    1 "Yes";

.  label define yr2
>    0 "No"
>    1 "Yes";

.  label define yr3
>    0 "No"
>    1 "Yes";

.  label define yr4
>    0 "No"
>    1 "Yes";

.  label define yr5
>    0 "No"
>    1 "Yes";

.  label define yr6
>    0 "No"
>    1 "Yes";

.  label define yr7
>    0 "No"
>    1 "Yes";

.  label define yr8
>    0 "No"
>    1 "Yes";

.  label define es
>    0 "No"
>    1 "Yes";

.  label define ms
>    0 "No"
>    1 "Yes";

.  label define hs
>    0 "No"
>    1 "Yes";

.  label define dist_3
>    0 "No"
>    1 "Yes";

.  label define dist_8
>    0 "No"
>    1 "Yes";

.  label define dist_10
>    0 "No"
>    1 "Yes";

.  label define dist_12
>    0 "No"
>    1 "Yes";

.  label define ne1r
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy";

.  label define ne2r
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy";

.  label define ne3r
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy";

.  label define ne4r
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy";

.  label define ne5r
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy";

.  label define ne6r
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy";

.  label define ne7r
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy";

.  label define us1r
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy";

.  label define us2r
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy";

.  label define us3r
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy";

.  label define us4r
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy";

.  label define us5r
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy";

.  label define us5ar
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "grade level NA"
>   .c "Not coded in given year"
>    0 "no policy or provision"
>    1 "Weak policy"
>    2 "strong policy";

.  label define us6r
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy";

.  label define us7r
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy";

.  label define us8r
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy";

.  label define us9r
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy";

.  label define us10r
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy";

.  label define us11r
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy";

.  label define us12r
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy";

.  label define us13r
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy";

.  label define us14r
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy";

.  label define us15r
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy";

.  label define ng1r
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy";

.  label define ng2r
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy";

.  label define ng2rsd
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "Applies at all times or sd not specified"
>    1 "Applies only during the sd"
>    2 "Applies at all times--only in y1 y2";

.  label define ng3r
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy";

.  label define ng3rsd
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "Applies at all times or sd not specified"
>    1 "Applies only during the sd"
>    2 "Applies at all times--only in y1 y2";

.  label define ng4r
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy";

.  label define ng4rsd
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "Applies at all times or sd not specified"
>    1 "Applies only during the sd"
>    2 "Applies at all times--only in y1 y2";

.  label define ng5r
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy";

.  label define ng5rsd
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "Applies at all times or sd not specified"
>    1 "Applies only during the sd"
>    2 "Applies at all times--only in y1 y2";

.  label define ng6r
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy";

.  label define ng7r
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy";

.  label define ng8r
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy";

.  label define ng9r
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy";

.  label define ng10r
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy"
>    4 "Bans vending machines or all competitive foods & beverages";

.  label define ng10rsd
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "Applies at all times or sd not specified"
>    1 "Applies only during the sd"
>    2 "Applies at all times--only in y1 y2";

.  label define ng16rvm
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Ban vending or competitive foods";

.  label define ng16rvmsd
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Ban vending or competitive foods";

.  label define ng17rvm
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Ban vending or competitive foods";

.  label define ng17rvmsd
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Ban vending or competitive foods";

.  label define ng18rvm
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Ban vending or competitive foods";

.  label define ng18rvmsd
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Ban vending or competitive foods";

.  label define ng19rvm
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Ban vending or competitive foods";

.  label define ng19rvmsd
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Ban vending or competitive foods";

.  label define ng20rvm
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Ban vending or competitive foods";

.  label define ng20rvmsd
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Ban vending or competitive foods";

.  label define ng21rvm
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Ban vending or competitive foods";

.  label define ng21rvmsd
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Ban vending or competitive foods";

.  label define ng22rvm
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Ban vending or competitive foods";

.  label define ng22rvmsd
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Ban vending or competitive foods";

.  label define ng23rvm
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Ban vending or competitive foods";

.  label define ng23rvmsd
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Ban vending or competitive foods";

.  label define ng24rvm
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Ban vending or competitive foods";

.  label define ng24rvmsd
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Ban vending or competitive foods";

.  label define ng25rvm
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Ban vending or competitive foods";

.  label define ng25rvmsd
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Ban vending or competitive foods";

.  label define ng26rvm
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Ban vending or competitive foods";

.  label define ng26rvmsd
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Ban vending or competitive foods";

.  label define ng27rvm
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Ban vending or competitive foods";

.  label define ng27rvmsd
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Ban vending or competitive foods";

.  label define ng28rvm
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Ban vending or competitive foods";

.  label define ng28rvmsd
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Ban vending or competitive foods";

.  label define ng29rvm
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Ban vending or competitive foods";

.  label define ng30rvm
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Ban competitive beverages";

.  label define ng30rvmsd
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Ban competitive beverages";

.  label define ng29rvmsd
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Ban vending or competitive foods";

.  label define ng11r
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy"
>    4 "Bans vending machines or all competitive foods & beverages";

.  label define ng11rsd
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "Applies at all times or sd not specified"
>    1 "Applies only during the sd"
>    2 "Applies at all times--only in y1 y2";

.  label define ng16rss
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Ban vending or competitive foods";

.  label define ng16rsssd
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Ban vending or competitive foods";

.  label define ng17rss
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Ban vending or competitive foods";

.  label define ng17rsssd
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Ban vending or competitive foods";

.  label define ng18rss
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Ban vending or competitive foods";

.  label define ng18rsssd
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Ban vending or competitive foods";

.  label define ng19rss
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Ban vending or competitive foods";

.  label define ng19rsssd
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Ban vending or competitive foods";

.  label define ng20rss
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Ban vending or competitive foods";

.  label define ng20rsssd
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Ban vending or competitive foods";

.  label define ng21rss
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Ban vending or competitive foods";

.  label define ng21rsssd
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Ban vending or competitive foods";

.  label define ng22rss
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Ban vending or competitive foods";

.  label define ng22rsssd
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Ban vending or competitive foods";

.  label define ng23rss
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Ban vending or competitive foods";

.  label define ng23rsssd
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Ban vending or competitive foods";

.  label define ng24rss
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Ban vending or competitive foods";

.  label define ng24rsssd
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Ban vending or competitive foods";

.  label define ng25rss
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Ban vending or competitive foods";

.  label define ng25rsssd
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Ban vending or competitive foods";

.  label define ng26rss
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Ban vending or competitive foods";

.  label define ng26rsssd
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Ban vending or competitive foods";

.  label define ng27rss
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Ban vending or competitive foods";

.  label define ng27rsssd
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Ban vending or competitive foods";

.  label define ng28rss
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Ban vending or competitive foods";

.  label define ng28rsssd
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Ban vending or competitive foods";

.  label define ng29rss
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Ban vending or competitive foods";

.  label define ng29rsssd
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Ban vending or competitive foods";

.  label define ng30rss
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Ban competitive beverages";

.  label define ng30rsssd
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Ban competitive beverages";

.  label define ng12r
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "strong policy"
>    4 "bans A la carte or all competitive foods & beverages";

.  label define ng16ral
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Ban A la carte or competitive foods";

.  label define ng17ral
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Ban A la carte or competitive foods";

.  label define ng18ral
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Ban A la carte or competitive foods";

.  label define ng19ral
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Ban A la carte or competitive foods";

.  label define ng20ral
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Ban A la carte or competitive foods";

.  label define ng21ral
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Ban A la carte or competitive foods";

.  label define ng22ral
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Ban A la carte or competitive foods";

.  label define ng23ral
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Ban A la carte or competitive foods";

.  label define ng24ral
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Ban A la carte or competitive foods";

.  label define ng25ral
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Ban A la carte or competitive foods";

.  label define ng26ral
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Ban A la carte or competitive foods";

.  label define ng27ral
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Ban A la carte or competitive foods";

.  label define ng28ral
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Ban A la carte or competitive foods";

.  label define ng29ral
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Ban A la carte or competitive foods";

.  label define ng30ral
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Ban competitive beverages";

.  label define ng13r
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "strong policy"
>    4 "bans A la carte or all competitive foods & beverages";

.  label define ng16rcp
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Ban competitive foods";

.  label define ng17rcp
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Ban competitive foods";

.  label define ng18rcp
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Ban competitive foods";

.  label define ng19rcp
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Ban competitive foods";

.  label define ng20rcp
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Ban competitive foods";

.  label define ng21rcp
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Ban competitive foods";

.  label define ng22rcp
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Ban competitive foods";

.  label define ng23rcp
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Ban competitive foods";

.  label define ng24rcp
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Ban competitive foods";

.  label define ng25rcp
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Ban competitive foods";

.  label define ng26rcp
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Ban competitive foods";

.  label define ng27rcp
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Ban competitive foods";

.  label define ng28rcp
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Ban competitive foods";

.  label define ng29rcp
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Ban competitive foods";

.  label define ng14r
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "strong policy"
>    4 "bans A la carte or all competitive foods & beverages";

.  label define ng16rev
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Ban competitive foods";

.  label define ng17rev
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Ban competitive foods";

.  label define ng18rev
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Ban competitive foods";

.  label define ng19rev
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Ban competitive foods";

.  label define ng20rev
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Ban competitive foods";

.  label define ng21rev
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Ban competitive foods";

.  label define ng22rev
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    3 "Strong policy: Meets IOM standard"
>    4 "Ban competitive beverages";

.  label define ng23rev
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy"
>    3 "Strong policy: Meets IOM standard"
>    4 "Ban competitive beverages";

.  label define ng24rev
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM standard"
>    4 "Ban competitive beverages";

.  label define ng25rev
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    3 "Strong policy: Meets IOM standard"
>    4 "Ban competitive beverages";

.  label define ng26rev
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Bans evening community events or competitive beverages";

.  label define ng27rev
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Bans evening community events or competitive beverages";

.  label define ng28rev
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Bans evening community events or competitive beverages";

.  label define ng29rev
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Bans evening community events or competitive beverages";

.  label define ng15r
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "strong policy"
>    4 "bans fundraisers or all competitive foods & beverages";

.  label define ng15rsd
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "applies at all times or sd ns"
>    1 "only applies during sd";

.  label define ng16rfr
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Ban competitive foods";

.  label define ng16rfrsd
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Ban competitive beverages";

.  label define ng17rfr
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Ban competitive foods";

.  label define ng17rfrsd
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Ban competitive beverages";

.  label define ng18rfr
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Ban competitive foods";

.  label define ng18rfrsd
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Ban competitive beverages";

.  label define ng19rfr
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Ban competitive foods";

.  label define ng19rfrsd
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Ban competitive beverages";

.  label define ng20rfr
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Ban competitive foods";

.  label define ng20rfrsd
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Ban competitive beverages";

.  label define ng21rfr
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Ban competitive foods";

.  label define ng21rfrsd
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Ban competitive beverages";

.  label define ng22rfr
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Ban competitive foods";

.  label define ng22rfrsd
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Ban competitive beverages";

.  label define ng23rfr
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Ban competitive foods";

.  label define ng23rfrsd
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Ban competitive beverages";

.  label define ng24rfr
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Ban competitive foods";

.  label define ng24rfrsd
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Ban competitive beverages";

.  label define ng25rfr
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Ban competitive foods";

.  label define ng25rfrsd
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Ban competitive beverages";

.  label define ng26rfr
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Bans fundraisers or competitive beverages";

.  label define ng26rfrsd
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Ban competitive beverages";

.  label define ng27rfr
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Ban competitive beverages";

.  label define ng27rfrsd
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Ban competitive beverages";

.  label define ng28rfr
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Ban competitive beverages";

.  label define ng28rfrsd
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Ban competitive beverages";

.  label define ng29rfr
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Ban competitive beverages";

.  label define ng29rfrsd
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy: < IOM Standard"
>    3 "Strong policy: Meets IOM Standard"
>    4 "Ban competitive beverages";

.  label define pe1r
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "PE addressed in wellness policy";

.  label define pe2r
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy";

.  label define pe3r
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy";

.  label define pe4r
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy";

.  label define pe5r
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy";

.  label define pe6r
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy";

.  label define pe7r
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy";

.  label define pe8r
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy";

.  label define pe9r
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy";

.  label define pe10r
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy";

.  label define pe11r
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy";

.  label define pe12r
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy";

.  label define pe13r
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy";

.  label define pe14r
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy";

.  label define pe15r
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy";

.  label define pe16r
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy";

.  label define pe17r
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy";

.  label define pa1r
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "strong policy";

.  label define pa2r
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "strong policy";

.  label define pa3r
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "strong policy";

.  label define pa3br
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No"
>    1 "Yes";

.  label define pa3cr
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No"
>    1 "Yes";

.  label define pa4r
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "strong policy";

.  label define pa5r
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "strong policy";

.  label define pa6r
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "strong policy";

.  label define pa7r
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "strong policy";

.  label define pa8r
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "strong policy";

.  label define pa9r
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "strong policy";

.  label define pa10r
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "strong policy";

.  label define st1r
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "strong policy";

.  label define st2r
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "strong policy";

.  label define st3r
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "strong policy";

.  label define cp1r
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "strong policy";

.  label define cp2r
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "strong policy";

.  label define cp3r
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "strong policy";

.  label define cp4r
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "strong policy";

.  label define cp5r
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "strong policy";

.  label define mp1r
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "strong policy";

.  label define mp2r
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "strong policy";

.  label define mp3r
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "strong policy";

.  label define e1r
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "strong policy";

.  label define e2r
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "strong policy";

.  label define e3r
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "strong policy";

.  label define e4r_new
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "bmi suggested encouraged or phased in requirements not yet effective"
>    2 "bmi measurement required for some but not all grades"
>    3 "bmi measurement required no reporting"
>    4 "bmi measurement required with reporting";

.  label define e5r
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "strong policy";

.  label define e6r
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "strong policy";

.  label define e7r
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "strong policy";

.  label define e8r
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "strong policy";

.  label define e12r
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "strong policy";

.  label define r1r
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy";

.  label define r2r
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy";

.  label define r3r
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy";

.  label define r4r
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy";

.  label define r5r
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy";

.  label define r6r
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy";

.  label define r7r
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy";

.  label define r8r
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy";

.  label define r9r
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy";

.  label define r10r
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy";

.  label define r11r
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy";

.  label define r12r
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy";

.  label define r13r
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy";

.  label define r14r
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy";

.  label define r15r
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy";

.  label define r16r
>   .n "Not Applicable"
>   .m "Policy missing"
>   .g "Grade level NA"
>   .c "Not coded in given year"
>    0 "No policy or provision"
>    1 "Weak policy"
>    2 "Strong policy";

.  label define region
>    1 "West"
>    2 "Midwest"
>    3 "South"
>    4 "Northeast"
>    5 "Pacific";

.  label define locale_4grp
>    1 "Large to mid-size city"
>    2 "Suburban"
>    3 "Rural"
>    4 "Township";

.  label define free_redlch_elig_pr_gt66
>    0 "No"
>    1 "Yes";

.  label values gradelevelnumeric gradelevelnumeric ;

.  label values year year ;

.  label values yr1 yr1 ;

.  label values yr2 yr2 ;

.  label values yr3 yr3 ;

.  label values yr4 yr4 ;

.  label values yr5 yr5 ;

.  label values yr6 yr6 ;

.  label values yr7 yr7 ;

.  label values yr8 yr8 ;

.  label values es es ;

.  label values ms ms ;

.  label values hs hs ;

.  label values dist_3 dist_3 ;

.  label values dist_8 dist_8 ;

.  label values dist_10 dist_10 ;

.  label values dist_12 dist_12 ;

.  label values ne1r ne1r ;

.  label values ne2r ne2r ;

.  label values ne3r ne3r ;

.  label values ne4r ne4r ;

.  label values ne5r ne5r ;

.  label values ne6r ne6r ;

.  label values ne7r ne7r ;

.  label values us1r us1r ;

.  label values us2r us2r ;

.  label values us3r us3r ;

.  label values us4r us4r ;

.  label values us5r us5r ;

.  label values us5ar us5ar ;

.  label values us6r us6r ;

.  label values us7r us7r ;

.  label values us8r us8r ;

.  label values us9r us9r ;

.  label values us10r us10r ;

.  label values us11r us11r ;

.  label values us12r us12r ;

.  label values us13r us13r ;

.  label values us14r us14r ;

.  label values us15r us15r ;

.  label values ng1r ng1r ;

.  label values ng2r ng2r ;

.  label values ng2rsd ng2rsd ;

.  label values ng3r ng3r ;

.  label values ng3rsd ng3rsd ;

.  label values ng4r ng4r ;

.  label values ng4rsd ng4rsd ;

.  label values ng5r ng5r ;

.  label values ng5rsd ng5rsd ;

.  label values ng6r ng6r ;

.  label values ng7r ng7r ;

.  label values ng8r ng8r ;

.  label values ng9r ng9r ;

.  label values ng10r ng10r ;

.  label values ng10rsd ng10rsd ;

.  label values ng16rvm ng16rvm ;

.  label values ng16rvmsd ng16rvmsd ;

.  label values ng17rvm ng17rvm ;

.  label values ng17rvmsd ng17rvmsd ;

.  label values ng18rvm ng18rvm ;

.  label values ng18rvmsd ng18rvmsd ;

.  label values ng19rvm ng19rvm ;

.  label values ng19rvmsd ng19rvmsd ;

.  label values ng20rvm ng20rvm ;

.  label values ng20rvmsd ng20rvmsd ;

.  label values ng21rvm ng21rvm ;

.  label values ng21rvmsd ng21rvmsd ;

.  label values ng22rvm ng22rvm ;

.  label values ng22rvmsd ng22rvmsd ;

.  label values ng23rvm ng23rvm ;

.  label values ng23rvmsd ng23rvmsd ;

.  label values ng24rvm ng24rvm ;

.  label values ng24rvmsd ng24rvmsd ;

.  label values ng25rvm ng25rvm ;

.  label values ng25rvmsd ng25rvmsd ;

.  label values ng26rvm ng26rvm ;

.  label values ng26rvmsd ng26rvmsd ;

.  label values ng27rvm ng27rvm ;

.  label values ng27rvmsd ng27rvmsd ;

.  label values ng28rvm ng28rvm ;

.  label values ng28rvmsd ng28rvmsd ;

.  label values ng29rvm ng29rvm ;

.  label values ng30rvm ng30rvm ;

.  label values ng30rvmsd ng30rvmsd ;

.  label values ng29rvmsd ng29rvmsd ;

.  label values ng11r ng11r ;

.  label values ng11rsd ng11rsd ;

.  label values ng16rss ng16rss ;

.  label values ng16rsssd ng16rsssd ;

.  label values ng17rss ng17rss ;

.  label values ng17rsssd ng17rsssd ;

.  label values ng18rss ng18rss ;

.  label values ng18rsssd ng18rsssd ;

.  label values ng19rss ng19rss ;

.  label values ng19rsssd ng19rsssd ;

.  label values ng20rss ng20rss ;

.  label values ng20rsssd ng20rsssd ;

.  label values ng21rss ng21rss ;

.  label values ng21rsssd ng21rsssd ;

.  label values ng22rss ng22rss ;

.  label values ng22rsssd ng22rsssd ;

.  label values ng23rss ng23rss ;

.  label values ng23rsssd ng23rsssd ;

.  label values ng24rss ng24rss ;

.  label values ng24rsssd ng24rsssd ;

.  label values ng25rss ng25rss ;

.  label values ng25rsssd ng25rsssd ;

.  label values ng26rss ng26rss ;

.  label values ng26rsssd ng26rsssd ;

.  label values ng27rss ng27rss ;

.  label values ng27rsssd ng27rsssd ;

.  label values ng28rss ng28rss ;

.  label values ng28rsssd ng28rsssd ;

.  label values ng29rss ng29rss ;

.  label values ng29rsssd ng29rsssd ;

.  label values ng30rss ng30rss ;

.  label values ng30rsssd ng30rsssd ;

.  label values ng12r ng12r ;

.  label values ng16ral ng16ral ;

.  label values ng17ral ng17ral ;

.  label values ng18ral ng18ral ;

.  label values ng19ral ng19ral ;

.  label values ng20ral ng20ral ;

.  label values ng21ral ng21ral ;

.  label values ng22ral ng22ral ;

.  label values ng23ral ng23ral ;

.  label values ng24ral ng24ral ;

.  label values ng25ral ng25ral ;

.  label values ng26ral ng26ral ;

.  label values ng27ral ng27ral ;

.  label values ng28ral ng28ral ;

.  label values ng29ral ng29ral ;

.  label values ng30ral ng30ral ;

.  label values ng13r ng13r ;

.  label values ng16rcp ng16rcp ;

.  label values ng17rcp ng17rcp ;

.  label values ng18rcp ng18rcp ;

.  label values ng19rcp ng19rcp ;

.  label values ng20rcp ng20rcp ;

.  label values ng21rcp ng21rcp ;

.  label values ng22rcp ng22rcp ;

.  label values ng23rcp ng23rcp ;

.  label values ng24rcp ng24rcp ;

.  label values ng25rcp ng25rcp ;

.  label values ng26rcp ng26rcp ;

.  label values ng27rcp ng27rcp ;

.  label values ng28rcp ng28rcp ;

.  label values ng29rcp ng29rcp ;

.  label values ng14r ng14r ;

.  label values ng16rev ng16rev ;

.  label values ng17rev ng17rev ;

.  label values ng18rev ng18rev ;

.  label values ng19rev ng19rev ;

.  label values ng20rev ng20rev ;

.  label values ng21rev ng21rev ;

.  label values ng22rev ng22rev ;

.  label values ng23rev ng23rev ;

.  label values ng24rev ng24rev ;

.  label values ng25rev ng25rev ;

.  label values ng26rev ng26rev ;

.  label values ng27rev ng27rev ;

.  label values ng28rev ng28rev ;

.  label values ng29rev ng29rev ;

.  label values ng15r ng15r ;

.  label values ng15rsd ng15rsd ;

.  label values ng16rfr ng16rfr ;

.  label values ng16rfrsd ng16rfrsd ;

.  label values ng17rfr ng17rfr ;

.  label values ng17rfrsd ng17rfrsd ;

.  label values ng18rfr ng18rfr ;

.  label values ng18rfrsd ng18rfrsd ;

.  label values ng19rfr ng19rfr ;

.  label values ng19rfrsd ng19rfrsd ;

.  label values ng20rfr ng20rfr ;

.  label values ng20rfrsd ng20rfrsd ;

.  label values ng21rfr ng21rfr ;

.  label values ng21rfrsd ng21rfrsd ;

.  label values ng22rfr ng22rfr ;

.  label values ng22rfrsd ng22rfrsd ;

.  label values ng23rfr ng23rfr ;

.  label values ng23rfrsd ng23rfrsd ;

.  label values ng24rfr ng24rfr ;

.  label values ng24rfrsd ng24rfrsd ;

.  label values ng25rfr ng25rfr ;

.  label values ng25rfrsd ng25rfrsd ;

.  label values ng26rfr ng26rfr ;

.  label values ng26rfrsd ng26rfrsd ;

.  label values ng27rfr ng27rfr ;

.  label values ng27rfrsd ng27rfrsd ;

.  label values ng28rfr ng28rfr ;

.  label values ng28rfrsd ng28rfrsd ;

.  label values ng29rfr ng29rfr ;

.  label values ng29rfrsd ng29rfrsd ;

.  label values pe1r pe1r ;

.  label values pe2r pe2r ;

.  label values pe3r pe3r ;

.  label values pe4r pe4r ;

.  label values pe5r pe5r ;

.  label values pe6r pe6r ;

.  label values pe7r pe7r ;

.  label values pe8r pe8r ;

.  label values pe9r pe9r ;

.  label values pe10r pe10r ;

.  label values pe11r pe11r ;

.  label values pe12r pe12r ;

.  label values pe13r pe13r ;

.  label values pe14r pe14r ;

.  label values pe15r pe15r ;

.  label values pe16r pe16r ;

.  label values pe17r pe17r ;

.  label values pa1r pa1r ;

.  label values pa2r pa2r ;

.  label values pa3r pa3r ;

.  label values pa3br pa3br ;

.  label values pa3cr pa3cr ;

.  label values pa4r pa4r ;

.  label values pa5r pa5r ;

.  label values pa6r pa6r ;

.  label values pa7r pa7r ;

.  label values pa8r pa8r ;

.  label values pa9r pa9r ;

.  label values pa10r pa10r ;

.  label values st1r st1r ;

.  label values st2r st2r ;

.  label values st3r st3r ;

.  label values cp1r cp1r ;

.  label values cp2r cp2r ;

.  label values cp3r cp3r ;

.  label values cp4r cp4r ;

.  label values cp5r cp5r ;

.  label values mp1r mp1r ;

.  label values mp2r mp2r ;

.  label values mp3r mp3r ;

.  label values e1r e1r ;

.  label values e2r e2r ;

.  label values e3r e3r ;

.  label values e4r_new e4r_new ;

.  label values e5r e5r ;

.  label values e6r e6r ;

.  label values e7r e7r ;

.  label values e8r e8r ;

.  label values e12r e12r ;

.  label values r1r r1r ;

.  label values r2r r2r ;

.  label values r3r r3r ;

.  label values r4r r4r ;

.  label values r5r r5r ;

.  label values r6r r6r ;

.  label values r7r r7r ;

.  label values r8r r8r ;

.  label values r9r r9r ;

.  label values r10r r10r ;

.  label values r11r r11r ;

.  label values r12r r12r ;

.  label values r13r r13r ;

.  label values r14r r14r ;

.  label values r15r r15r ;

.  label values r16r r16r ;

.  label values region region ;

.  label values locale_4grp locale_4grp ;

.  label values free_redlch_elig_pr_gt66 free_redlch_elig_pr_gt66 ;

. #delimit cr
delimiter now cr
. 
. save_data "`derived_dir'/btg_school_district.dta", key(id gradelevel year) replace nopreserve
(data now sorted by id gradelevel year)
==================================================================================================
File: C:/Users/Samuele/Google Drive/research projects/obesity/derived/bridging_the_gap/school_district/btg_school_district.dta
Key: id gradelevel year
==================================================================================================
  15327:267(40703):904881352:3510707951

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
          id |     15327    4.98e+08    2.89e+08     630550   9.99e+08
  gradelevel |         0
        year |     15327    4.727735    2.295631          1          8
gradelevel~c |     15327           2    .8165232          1          3
         yr1 |     15327    .3051478     .460485          0          1
-------------+--------------------------------------------------------
         yr2 |     15327    .3266784    .4690138          0          1
         yr3 |     15327    .3047563    .4603192          0          1
         yr4 |     15327    .2759836    .4470231          0          1
         yr5 |     15327    .3133686    .4638779          0          1
         yr6 |     15327    .3924447    .4883108          0          1
-------------+--------------------------------------------------------
         yr7 |     15327    .3945978    .4887801          0          1
         yr8 |     15327    .3358779    .4723118          0          1
          es |     15327    .3333333    .4714199          0          1
          ms |     15327    .3333333    .4714199          0          1
          hs |     15327    .3333333    .4714199          0          1
-------------+--------------------------------------------------------
      dist_3 |     15327    .9530241    .2115942          0          1
      dist_8 |     15327     .939127     .239105          0          1
     dist_10 |     15327    .8623997    .3444912          0          1
     dist_12 |     15327    .8537874    .3533307          0          1
 distnrwgt_d |     15327    20.30723    25.10149   .1221354   656.4536
-------------+--------------------------------------------------------
     stratum |     15321     113.999    104.0961          1        335
    psu_deid |     15321    4.95e+08    2.83e+08    1991682   9.99e+08
       d_fpc |     15321    .0501748    .1262546          0          1
        ne1r |     14277    1.838061    .5230467          0          2
        ne2r |     14277    1.159417    .7612593          0          2
-------------+--------------------------------------------------------
        ne3r |     11025    .1345125     .362612          0          2
        ne4r |     14277    .4774112    .6628245          0          2
        ne5r |     14277    .8136163    .8809427          0          2
        ne6r |     14277    1.307137     .824983          0          2
        ne7r |     14277    .0617777    .2752406          0          2
-------------+--------------------------------------------------------
        us1r |     14277    1.734608    .6664849          0          2
        us2r |     14277    1.193598     .891057          0          2
        us3r |     14277    .9841003     .848886          0          2
        us4r |     14277    .2955103    .5696294          0          2
        us5r |     14277    .6661063    .7249762          0          2
-------------+--------------------------------------------------------
       us5ar |     11025    .0572336    .2817124          0          2
        us6r |      3814     .260881    .4915823          0          2
        us7r |     14278    .7135453    .6629299          0          2
        us8r |     14278    .4364057    .6428336          0          2
        us9r |     14278    .3471074    .6895154          0          2
-------------+--------------------------------------------------------
       us10r |     14278     .086987    .3202185          0          2
       us11r |      9422    .9073445    .9605371          0          2
       us12r |      9422    .8364466     .977779          0          2
       us13r |      9422     .175865    .5536297          0          2
       us14r |      5860    .2665529    .6658526          0          2
-------------+--------------------------------------------------------
       us15r |      4006     .040689    .2810573          0          2
        ng1r |     14278    1.506373    .6529506          0          2
        ng2r |     14278    .0718588     .294503          0          2
      ng2rsd |     14278    .0342485    .1818732          0          1
        ng3r |     14278    .4421488    .7911269          0          2
-------------+--------------------------------------------------------
      ng3rsd |     14278     .042513    .2017634          0          1
        ng4r |     11026     .004172    .0672141          0          2
      ng4rsd |     11026    .0001814    .0134675          0          1
        ng5r |     11026    .0102485    .1173563          0          2
      ng5rsd |     11026    .0003628    .0190442          0          1
-------------+--------------------------------------------------------
        ng6r |     14278    .6474996    .6172139          0          2
        ng7r |     14278    .4681328    .6760391          0          2
        ng8r |     14278    .1430172    .4796013          0          2
        ng9r |     14278    .2373582    .6294467          0          2
       ng10r |     14278     1.20339    .9379187          0          4
-------------+--------------------------------------------------------
     ng10rsd |     14278    .5040622     .500001          0          1
     ng16rvm |     11026    1.280972    1.365847          0          4
   ng16rvmsd |     11026     .432251    .4954113          0          1
     ng17rvm |     11026    .7749864    1.216692          0          4
   ng17rvmsd |     11026    .2799746    .4490068          0          1
-------------+--------------------------------------------------------
     ng18rvm |     11026    1.459278    1.290756          0          4
   ng18rvmsd |     11026    .4853981    .4998094          0          1
     ng19rvm |     11026    .9207328    1.330975          0          4
   ng19rvmsd |     11026    .3235988    .4678701          0          1
     ng20rvm |     11026    .7891348    1.230627          0          4
-------------+--------------------------------------------------------
   ng20rvmsd |     11026    .2238346    .4168314          0          1
     ng21rvm |     11026    .8746599    1.385142          0          4
   ng21rvmsd |     11026    .2479594    .4318477          0          1
     ng22rvm |     11026    .9970978    1.214945          0          4
   ng22rvmsd |     11026    .4424995    .4967052          0          1
-------------+--------------------------------------------------------
     ng23rvm |     11026      .46998    1.078698          0          4
   ng23rvmsd |     11026    .1750408    .3800192          0          1
     ng24rvm |     11026    1.413296    1.263247          0          4
   ng24rvmsd |     11026    .5094323    .4999337          0          1
     ng25rvm |     11026    .8011065    1.277498          0          4
-------------+--------------------------------------------------------
   ng25rvmsd |     11026    .3012879    .4588383          0          1
     ng26rvm |     11026    .6653365    1.192763          0          4
   ng26rvmsd |     11026    .2301832    .4209691          0          1
     ng27rvm |     11026    .7836931    1.238941          0          4
   ng27rvmsd |     11026    .2923091    .4548442          0          1
-------------+--------------------------------------------------------
     ng28rvm |     11026    .7601125    1.121729          0          4
   ng28rvmsd |     11026    .3329403    .4712868          0          1
     ng29rvm |     11026    .9995465    1.406851          0          4
     ng30rvm |      5860    .9967577    1.205533          0          4
   ng30rvmsd |      5860    .4554608    .4980548          0          1
-------------+--------------------------------------------------------
   ng29rvmsd |     11026    .3255034    .4685839          0          1
       ng11r |     14278    1.024373    .9135619          0          4
     ng11rsd |     14278     .470444    .4991432          0          1
     ng16rss |     11026    1.085616    1.272531          0          4
   ng16rsssd |     11026    .4177399    .4932092          0          1
-------------+--------------------------------------------------------
     ng17rss |     11026    .5998549    1.035889          0          4
   ng17rsssd |     11026    .2593869    .4383181          0          1
     ng18rss |     11026    1.253673    1.220961          0          4
   ng18rsssd |     11026    .4755124    .4994226          0          1
     ng19rss |     11026    .7380736    1.183697          0          4
-------------+--------------------------------------------------------
   ng19rsssd |     11026    .3086341    .4619507          0          1
     ng20rss |     11026    .6159985     1.06019          0          4
   ng20rsssd |     11026    .2105931    .4077484          0          1
     ng21rss |     11026    .6753129    1.238301          0          4
   ng21rsssd |     11026    .2206603    .4147106          0          1
-------------+--------------------------------------------------------
     ng22rss |     11026    .8205151       1.105          0          4
   ng22rsssd |     11026     .424542    .4942957          0          1
     ng23rss |     11026    .3633231    .9277055          0          4
   ng23rsssd |     11026    .1642481    .3705174          0          1
     ng24rss |     11026    1.188464     1.22374          0          4
-------------+--------------------------------------------------------
   ng24rsssd |     11026    .4658988    .4988584          0          1
     ng25rss |     11026      .63577    1.140842          0          4
   ng25rsssd |     11026    .2794304    .4487397          0          1
     ng26rss |     11026    .5427172    1.067873          0          4
   ng26rsssd |     11026    .2154907    .4111809          0          1
-------------+--------------------------------------------------------
     ng27rss |     11026    .6372211    1.121421          0          4
   ng27rsssd |     11026     .273626    .4458395          0          1
     ng28rss |     11026    .6208961    .9961079          0          4
   ng28rsssd |     11023    .3163386    .4650678          0          1
     ng29rss |     11026    .8328496    1.299885          0          4
-------------+--------------------------------------------------------
   ng29rsssd |     11026    .3091783    .4621758          0          1
     ng30rss |      5860    .8109215    1.092614          0          4
   ng30rsssd |      5860    .4414676    .4966045          0          1
       ng12r |     14278    1.119975    .7647356          0          4
     ng16ral |     11025    1.056961    1.185461          0          4
-------------+--------------------------------------------------------
     ng17ral |     11026    .7827861    .8938577          0          4
     ng18ral |     11026     1.28723    1.136863          0          4
     ng19ral |     11026    .7410666    1.097337          0          4
     ng20ral |     11026     .568021    .9385416          0          4
     ng21ral |     11026    .6169962    1.143237          0          4
-------------+--------------------------------------------------------
     ng22ral |     11026    .8241429    1.016954          0          4
     ng23ral |     11026    .2901324    .7561009          0          4
     ng24ral |     11026      1.4922    1.094775          0          4
     ng25ral |     11026    .6329585    1.059567          0          4
     ng26ral |     11026    .5409033    .9809086          0          4
-------------+--------------------------------------------------------
     ng27ral |     11026    .6261564    1.055512          0          4
     ng28ral |     11026    .6010339    .8761878          0          4
     ng29ral |     11026    .9149284     1.30202          0          4
     ng30ral |      5860    .8179181    1.013707          0          4
       ng13r |     14279    .6520064    .5142472          0          4
-------------+--------------------------------------------------------
     ng16rcp |     11026    .2231997    .5495581          0          4
     ng17rcp |     11026    .1507346    .4163854          0          4
     ng18rcp |     11026    .3196082     .583033          0          4
     ng19rcp |     11026    .1353165    .4459043          0          4
     ng20rcp |     11026    .2500453    .4941036          0          4
-------------+--------------------------------------------------------
     ng21rcp |     11026     .081988    .3852005          0          4
     ng22rcp |     11026    .1525485    .4267064          0          4
     ng23rcp |     11026    .0150553     .160357          0          4
     ng24rcp |     11026    .3153455    .6857502          0          4
     ng25rcp |     11026    .0730093    .3407645          0          4
-------------+--------------------------------------------------------
     ng26rcp |     11026    .0597678    .2818168          0          4
     ng27rcp |     11026    .1140033    .3997389          0          4
     ng28rcp |     11026    .0945946    .3362239          0          4
     ng29rcp |     11026    .1202612    .4544099          0          4
       ng14r |      8418    .1520551    .3784264          0          2
-------------+--------------------------------------------------------
     ng16rev |      5166    .0497484    .2859114          0          3
     ng17rev |      5166    .0195509    .1543342          0          2
     ng18rev |      5166    .0555556    .2974742          0          3
     ng19rev |      5166    .0305846    .1993055          0          2
     ng20rev |      5166    .0365854    .2182769          0          2
-------------+--------------------------------------------------------
     ng21rev |      5166    .0079365    .0950616          0          2
     ng22rev |      5166    .0323268    .1768835          0          1
     ng23rev |      5166     .004065    .0636341          0          1
     ng24rev |      5166    .0423926     .233545          0          2
     ng25rev |      5166    .0216802    .1456513          0          1
-------------+--------------------------------------------------------
     ng26rev |      5166    .0065815    .0808668          0          1
     ng27rev |      5166    .0278746    .1646293          0          1
     ng28rev |      5166    .0261324    .1853659          0          2
     ng29rev |      5166     .039489    .2588022          0          3
       ng15r |     14278    .8875193    .8966077          0          4
-------------+--------------------------------------------------------
     ng15rsd |     14277    .4292919    .4949924          0          1
     ng16rfr |     11025    .8773696    1.254173          0          4
   ng16rfrsd |     11025    .3733333    .4837115          0          1
     ng17rfr |     11025    .5393197    1.039374          0          4
   ng17rfrsd |     11025    .2273923     .419167          0          1
-------------+--------------------------------------------------------
     ng18rfr |     11025    .9580952    1.228688          0          4
   ng18rfrsd |     11025    .4054422    .4909997          0          1
     ng19rfr |     11025    .5586395    1.063664          0          4
   ng19rfrsd |     11025    .2712018    .4446002          0          1
     ng20rfr |     11025     .477551    1.048302          0          4
-------------+--------------------------------------------------------
   ng20rfrsd |     11025    .1805896    .3846952          0          1
     ng21rfr |     11025    .5640816    1.165348          0          4
   ng21rfrsd |     11025    .2012698    .4009674          0          1
     ng22rfr |     11025    .6664853    1.096102          0          4
   ng22rfrsd |     11025    .3512018    .4773675          0          1
-------------+--------------------------------------------------------
     ng23rfr |     11025    .2819955    .9065695          0          4
   ng23rfrsd |     11025     .107483    .3097404          0          1
     ng24rfr |     11025    .9689796    1.223981          0          4
   ng24rfrsd |     11025    .4010884    .4901411          0          1
     ng25rfr |     11025    .5430385    1.107839          0          4
-------------+--------------------------------------------------------
   ng25rfrsd |     11025    .2428118    .4288017          0          1
     ng26rfr |     11025    .4869841    1.060078          0          4
   ng26rfrsd |     11025     .186576    .3895884          0          1
     ng27rfr |     11025    .4973243    1.050182          0          4
   ng27rfrsd |     11025    .2316553    .4219091          0          1
-------------+--------------------------------------------------------
     ng28rfr |     11025    .5095692    .9930473          0          4
   ng28rfrsd |     11025    .2654875    .4416125          0          1
     ng29rfr |     11025    .7239002    1.269319          0          4
   ng29rfrsd |     11025    .2788209    .4484395          0          1
        pe1r |     14278    .8872391    .3163114          0          1
-------------+--------------------------------------------------------
        pe2r |     14278    1.154924    .8331116          0          2
        pe3r |      4933    .3606325    .5561415          0          2
        pe4r |      4867    .3032669      .51055          0          2
        pe5r |      4478    .2067887    .4558981          0          2
        pe6r |     14278    1.307956     .910159          0          2
-------------+--------------------------------------------------------
        pe7r |     14278    .9679227    .9620999          0          2
        pe8r |      4478    .4294328     .806939          0          2
        pe9r |     14278    .1460989    .4730784          0          2
       pe10r |     14278    .1936546    .4461273          0          2
       pe11r |     14278    .3522202    .6694111          0          2
-------------+--------------------------------------------------------
       pe12r |     14278    .4801093     .657277          0          2
       pe13r |     14278    .6624877    .8972782          0          2
       pe14r |     14278    .3340104    .7098554          0          2
       pe15r |     14278    .1339123    .4806226          0          2
       pe16r |     14278    .3775039    .5065415          0          2
-------------+--------------------------------------------------------
       pe17r |      5860    .0005119    .0226223          0          1
        pa1r |     14278    1.788696     .591048          0          2
        pa2r |     14278    1.061423    .8552575          0          2
        pa3r |     11026     .152095     .491371          0          2
       pa3br |       631    .9096672    .2868854          0          1
-------------+--------------------------------------------------------
       pa3cr |       300    .9566667    .2039466          0          1
        pa4r |     14278    .6393753    .6895361          0          2
        pa5r |     14278    .4242891     .746013          0          2
        pa6r |     14278    .2279731    .5812163          0          2
        pa7r |     14278    .4891441    .7768367          0          2
-------------+--------------------------------------------------------
        pa8r |      4933    .5603081     .800105          0          2
        pa9r |      3814     .286838    .6033822          0          2
       pa10r |      5860    .1967577    .5252034          0          2
        st1r |     14278    .2712565    .5585696          0          2
        st2r |     14278    .3754728    .6514025          0          2
-------------+--------------------------------------------------------
        st3r |     14278    .5875473    .8509444          0          2
        cp1r |     14278     .794439    .8622128          0          2
        cp2r |     14278    .5899286     .791318          0          2
        cp3r |     14278    .6542933    .8779075          0          2
        cp4r |      5860    .6035836    .7801651          0          2
-------------+--------------------------------------------------------
        cp5r |      5860    .3250853    .6500374          0          2
        mp1r |     14278    .4398375    .8119295          0          2
        mp2r |     14282    .3250945    .5694893          0          2
        mp3r |     14278    .3432554    .6932117          0          2
         e1r |     14278    1.647219    .7346784          0          2
-------------+--------------------------------------------------------
         e2r |     14278    1.614722    .7566374          0          2
         e3r |     14278    1.072559    .9476317          0          2
     e4r_new |     14279    .4307024    .7719873          0          4
         e5r |     14278      .68525    .6603423          0          2
         e6r |     14278    .8805155      .86345          0          2
-------------+--------------------------------------------------------
         e7r |     14278     .059182    .2607889          0          2
         e8r |     14278    .7341364    .9015712          0          2
        e12r |     14278    .0282252    .2342803          0          2
         r1r |      7720    .0419689    .2812079          0          2
         r2r |      7720    .1915803    .5316334          0          2
-------------+--------------------------------------------------------
         r3r |      7720    .0143782    .1654917          0          2
         r4r |      7720    .4001295    .7870075          0          2
         r5r |      7720    1.073834    .9879383          0          2
         r6r |      7720    .0524611    .3178323          0          2
         r7r |      7720    .1002591    .4283634          0          2
-------------+--------------------------------------------------------
         r8r |      7720    .0977979    .4171419          0          2
         r9r |      7720    1.084326    .9834822          0          2
        r10r |      7717    .1082027    .4453915          0          2
        r11r |      7717    .3681482    .7433035          0          2
        r12r |      7720    .1761658    .5216413          0          2
-------------+--------------------------------------------------------
        r13r |      7720    .1367876    .4863138          0          2
        r14r |      7720    .1426166    .5020981          0          2
        r15r |      7720    .0527202    .3027582          0          2
        r16r |      7720    .3106218    .6801775          0          2
      region |     15327     2.55001    1.032154          1          4
-------------+--------------------------------------------------------
 locale_4grp |     15306    2.414347    .9780408          1          4
free_redl~66 |     14775    .1843655    .3877951          0          1




file C:/Users/Samuele/Google Drive/research projects/obesity/derived/bridging_the_gap/school_district/btg_school_district.dta saved

. 
end of do-file

 make.py ended: 2017-11-10 10:55:54
